
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

5-user 4-core Stata network perpetual license:
       Serial number:  501306214279
         Licensed to:  Department of Economics
                       University College London

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do bismoking.do 

. 
. set more off

. 
. cd ~/git/baowen/
/data/uctprgu/git/baowen

. use miedlong, clear
(SAVASTATA created this dataset on 01JAN2014)

. 
. mi estimate: xtlogit bismoking re4m re5m gender i.retireageg i.provinces i.wo
> rkspouse i.lastalcohol i.education i.skills lastincome i.stratum ///
> birthcohort i.lastactivity if  basmoke==1& flag==1&yrsinceretire>=-17&yrsince
> retire<=17&wave>=1991, pa vce(robust)

Multiple-imputation estimates                   Imputations        =        20
Population-averaged logistic regression         Number of obs      =      5410

Group variable:                      idind      Number of groups   =      1022
Link:                                logit      Obs per group: min =         2
Family:                           binomial                     avg =       5.3
Correlation:                  exchangeable                     max =         8
Scale parameter:                         1
                                                Average RVI        =    0.0169
                                                Largest FMI        =    0.0652
DF adjustment:                Large sample      DF:     min        =   4519.96
                                                        avg        = 379984.72
                                                        max        =  2.56e+06
Model F test:                    Equal FMI      F(  37, 2.5e+06)   =     10.07
Within VCE type:                    Robust      Prob > F           =    0.0000

                                 (Within VCE adjusted for clustering on idind)
------------------------------------------------------------------------------
   bismoking |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        re4m |  -.0559818    .009143    -6.12   0.000    -.0739017   -.0380619
        re5m |  -.0332498   .0159435    -2.09   0.037    -.0644987   -.0020009
      gender |  -4.014147    .334905   -11.99   0.000    -4.670553   -3.357741
             |
  retireageg |
          1  |  -.1418341   .2666526    -0.53   0.595    -.6644665    .3807982
          2  |   .1748503   .2849454     0.61   0.539    -.3836344    .7333351
          3  |  -.3766417   .3105349    -1.21   0.225    -.9852825    .2319991
          4  |  -.6876204   .4159213    -1.65   0.098    -1.502816    .1275755
          5  |  -.5668991   .5378885    -1.05   0.292    -1.621145    .4873467
             |
   provinces |
         23  |  -.6987661   .3579485    -1.95   0.051    -1.400333    .0028013
         32  |  -.1286942   .2585618    -0.50   0.619    -.6354663    .3780779
         37  |  -.1666877   .2694756    -0.62   0.536    -.6948512    .3614759
         41  |  -.5245525    .332177    -1.58   0.114    -1.175622    .1265167
         42  |  -.2927363   .2874742    -1.02   0.309    -.8561762    .2707036
         43  |  -.2703339   .2831849    -0.95   0.340    -.8253668    .2846991
         45  |  -.3027077   .2999024    -1.01   0.313    -.8905085    .2850931
         52  |   .1922967   .2927105     0.66   0.511    -.3814057    .7659991
             |
  workspouse |
          1  |  -.1202816   .1508687    -0.80   0.425    -.4159831    .1754199
          3  |  -.0739787   .3225879    -0.23   0.819    -.7062451    .5582876
             |
 lastalcohol |
          1  |   .6878939   .1619102     4.25   0.000     .3704935    1.005294
          2  |   1.209872    .324416     3.73   0.000     .5738671    1.845876
          3  |   .8315783   .2530406     3.29   0.001      .335495    1.327662
             |
   education |
          1  |  -.1322315   .2597885    -0.51   0.611    -.6414111    .3769481
          2  |  -.2681842   .2471827    -1.08   0.278    -.7526568    .2162885
          3  |  -.4794526   .2773283    -1.73   0.084     -1.02301    .0641051
          4  |  -.5572997    .303016    -1.84   0.066    -1.151203    .0366037
          5  |   -.623512   .3051974    -2.04   0.041    -1.221691    -.025333
             |
      skills |
          1  |  -.1626218   .3098875    -0.52   0.600    -.7699974    .4447538
          2  |   .3256408   .3266733     1.00   0.319    -.3146487    .9659303
          3  |  -.0168231   .3472148    -0.05   0.961    -.6973828    .6637366
             |
  lastincome |  -.1050134    .044054    -2.38   0.017    -.1913579    -.018669
             |
     stratum |
          2  |  -.0076822   .1995887    -0.04   0.969     -.398871    .3835066
          3  |  -.1072641   .1850255    -0.58   0.562    -.4699079    .2553798
          4  |   .3679513   .2182006     1.69   0.092    -.0597144    .7956171
             |
 birthcohort |   .0076707   .0131262     0.58   0.559    -.0180563    .0333977
             |
lastactivity |
          1  |   .1236995    .179039     0.69   0.490    -.2272288    .4746278
          2  |   .2876288   .2107082     1.37   0.172    -.1253774    .7006351
          3  |    .033906    .283252     0.12   0.905    -.5213592    .5891712
             |
       _cons |   2.039695   1.066366     1.91   0.056    -.0503744    4.129763
------------------------------------------------------------------------------

. mi estimate, cmdok: linesmo 1

Multiple-imputation estimates                     Imputations     =         20
Adjusted predictions                              Number of obs   =       5410
                                                  Average RVI     =     0.0088
                                                  Largest FMI     =     0.0259
DF adjustment:   Large sample                     DF:     min     =   28463.70
                                                          avg     =   49598.58
Within VCE type: Delta-method                             max     =  116243.54

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .4043527   .0526234     7.68   0.000     .3012101    .5074953
          2  |   .3909473   .0510902     7.65   0.000     .2908097     .491085
          3  |   .2170596   .0342559     6.34   0.000     .1499165    .2842027
          4  |   .2076987    .033567     6.19   0.000     .1419058    .2734915
          5  |   .1933978   .0316074     6.12   0.000      .131446    .2553497
          6  |   .0543856   .0131493     4.14   0.000     .0286131     .080158
------------------------------------------------------------------------------

. 
. mat smo2knot=e(b_mi)'

. svmat smo2knot

. matrix year2knot=(5\6\21\22\23\39)

. svmat year2knot

. 
. *************use xtlogit to simple the model, no multilevel******************
> **************
. mi estimate: xtlogit bismoking i.centerretire gender i.retireageg i.provinces
>  i.workspouse i.lastalcohol i.education i.skills lastincome i.stratum ///
> birthcohort i.lastactivity if  basmoke==1& flag==1&yrsinceretire>=-17&yrsince
> retire<=17&wave>=1991

Multiple-imputation estimates                   Imputations        =        20
Random-effects logistic regression              Number of obs      =      5410

Group variable: idind                           Number of groups   =      1022
Random effects u_i ~ Gaussian                   Obs per group: min =         2
                                                               avg =       5.3
Integration points = 12                                        max =         8

                                                Average RVI        =    0.0161
                                                Largest FMI        =    0.0612
DF adjustment:   Large sample                   DF:     min        =   5141.26
                                                        avg        =  9.92e+06
                                                        max        =  3.39e+08
Model F test:       Equal FMI                   F(  69, 5.2e+06)   =      5.26
Within VCE type:          OIM                   Prob > F           =    0.0000

------------------------------------------------------------------------------
   bismoking |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
centerretire |
          6  |   1.200003   1.141903     1.05   0.293    -1.038086    3.438093
          7  |   1.586289   .9226814     1.72   0.086    -.2221332    3.394712
          8  |   1.006175   .8537652     1.18   0.239    -.6671743    2.679524
          9  |   1.227101   .7940697     1.55   0.122    -.3292469    2.783449
         10  |   .2327305   .7530384     0.31   0.757    -1.243198    1.708659
         11  |   .0443254    .712151     0.06   0.950    -1.351468    1.440119
         12  |   1.220226   .7346941     1.66   0.097    -.2197478      2.6602
         13  |   1.119067   .7471049     1.50   0.134    -.3452653    2.583399
         14  |   .2371548   .6745511     0.35   0.725    -1.084942    1.559252
         15  |   .2926077   .7393781     0.40   0.692    -1.156547    1.741762
         16  |   .1970252   .6657937     0.30   0.767    -1.107907    1.501957
         17  |  -.3864046   .6666158    -0.58   0.562    -1.692953    .9201435
         18  |  -.1617968     .64215    -0.25   0.801    -1.420388    1.096794
         19  |  -.4050236   .6937118    -0.58   0.559    -1.764674    .9546269
         20  |  -.5181331   .6412849    -0.81   0.419    -1.775029    .7387625
         21  |   -.483433   .6351319    -0.76   0.447    -1.728269    .7614026
         22  |  -.1704901   .7181433    -0.24   0.812    -1.578025    1.237045
         23  |  -1.071527   .6278605    -1.71   0.088    -2.302112     .159057
         24  |   -1.32803   .6593306    -2.01   0.044    -2.620295   -.0357654
         25  |  -.9244532   .6708035    -1.38   0.168    -2.239208    .3903015
         26  |  -1.599549   .6722547    -2.38   0.017    -2.917145   -.2819525
         27  |  -1.734165   .6660161    -2.60   0.009    -3.039534   -.4287955
         28  |  -1.607935   .6996094    -2.30   0.022     -2.97915   -.2367206
         29  |  -1.909218   .6876321    -2.78   0.005    -3.256959   -.5614769
         30  |  -1.968285   .7153772    -2.75   0.006    -3.370399    -.566171
         31  |  -2.711633   .7149076    -3.79   0.000    -4.112827   -1.310438
         32  |  -2.159016   .7287784    -2.96   0.003    -3.587397   -.7306354
         33  |   -2.80456   .7683394    -3.65   0.000    -4.310478   -1.298642
         34  |   -3.05414   .7419859    -4.12   0.000    -4.508412   -1.599868
         35  |  -1.791957   .8298262    -2.16   0.031    -3.418387   -.1655278
         36  |  -3.334938   .8267759    -4.03   0.000     -4.95539   -1.714486
         37  |  -2.058877   .9711195    -2.12   0.034    -3.962238   -.1555157
         38  |  -3.485794    .961354    -3.63   0.000    -5.370014   -1.601574
         39  |  -3.345688   1.000497    -3.34   0.001    -5.306634   -1.384743
             |
      gender |  -7.266775    .548455   -13.25   0.000     -8.34175   -6.191801
             |
  retireageg |
      50/54  |    .141014   .5927815     0.24   0.812    -1.020821    1.302849
      55/59  |   .5584571   .6228802     0.90   0.370    -.6623701    1.779284
      60/64  |  -.4747149   .6710153    -0.71   0.479    -1.789888    .8404581
      65/69  |  -.9423537    .844001    -1.12   0.264    -2.596586    .7118784
      70/86  |  -.4246639    .987139    -0.43   0.667     -2.35945    1.510122
             |
   provinces |
         23  |  -1.178896   .6575565    -1.79   0.073    -2.467687    .1098944
         32  |  -.3596544   .5102866    -0.70   0.481    -1.359799    .6404901
         37  |  -.1622767   .5213649    -0.31   0.756    -1.184137    .8595835
         41  |   -.880228   .6648946    -1.32   0.186    -2.183488    .4230323
         42  |  -.8051653   .5922997    -1.36   0.174    -1.966055     .355724
         43  |  -.4299321   .5437524    -0.79   0.429    -1.495672    .6358079
         45  |  -.6012835   .6024505    -1.00   0.318    -1.782071    .5795038
         52  |   .2385623   .6139614     0.39   0.698    -.9647814    1.441906
             |
  workspouse |
1 notwork..  |  -.2070169   .3128767    -0.66   0.508    -.8202528    .4062189
          3  |   .0523004   .5854831     0.09   0.929    -1.095272    1.199873
             |
 lastalcohol |
 1 light ..  |   1.460654   .3366057     4.34   0.000     .8007636    2.120544
 2 modera..  |    2.63032   .6026437     4.36   0.000     1.448955    3.811685
3 heavy d..  |   1.849206   .5213934     3.55   0.000     .8271617    2.871249
             |
   education |
1 graduat..  |  -.4653413   .4955892    -0.94   0.348    -1.436682    .5059997
2lower mi..  |  -.4983313    .491691    -1.01   0.311    -1.462033    .4653699
 3 High s..  |  -1.264213   .5685361    -2.22   0.026    -2.378528   -.1498973
 4 techni..  |  -1.300266   .6115936    -2.13   0.034    -2.498973   -.1015584
 5 colleg..  |  -1.513468   .6367452    -2.38   0.017    -2.761468   -.2654684
             |
      skills |
          1  |  -.6829241   .5781761    -1.18   0.238    -1.816256     .450408
          2  |   .2454522   .6180457     0.40   0.691    -.9659746    1.456879
 3 highes..  |  -.3739702   .6592639    -0.57   0.571    -1.666247    .9183071
             |
  lastincome |  -.1508414   .0992056    -1.52   0.128    -.3452834    .0436007
             |
     stratum |
          2  |  -.0005513   .3963857    -0.00   0.999    -.7774557     .776353
          3  |  -.1144953   .3849131    -0.30   0.766    -.8689152    .6399245
          4  |   .4825033   .4436683     1.09   0.277    -.3870744    1.352081
             |
 birthcohort |   .0234133   .0261299     0.90   0.370     -.027801    .0746275
             |
lastactivity |
    1 light  |   .2300467    .353622     0.65   0.515    -.4630764    .9231699
 2 moderate  |   .5837369   .4321664     1.35   0.177    -.2633417    1.430816
3 heavy o..  |   .1239528   .5695708     0.22   0.828    -.9925469    1.240452
             |
       _cons |   1.241056   2.263326     0.55   0.583    -3.195049    5.677161
-------------+----------------------------------------------------------------
    /lnsig2u |    2.23358   .1223915                      1.993685    2.473475
-------------+----------------------------------------------------------------
     sigma_u |   3.055032    .186955                      2.709713    3.444357
         rho |   .7393769   .0235847                      .6905812    .7828966
------------------------------------------------------------------------------

. 
. mi estimate, cmdok: mimarginsmo 1 

Multiple-imputation estimates                     Imputations     =         20
Adjusted predictions                              Number of obs   =       5410
                                                  Average RVI     =     0.0142
                                                  Largest FMI     =     0.0549
DF adjustment:   Large sample                     DF:     min     =    6364.19
                                                          avg     =   92656.76
Within VCE type: Delta-method                             max     =  664488.04

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
centerretire |
          5  |  -1.570224   .6712393    -2.34   0.019    -2.885838   -.2546106
          6  |  -.3702208   1.004897    -0.37   0.713    -2.339787    1.599346
          7  |   .0160649    .785898     0.02   0.984     -1.52427    1.556399
          8  |  -.5640495   .6683041    -0.84   0.399     -1.87391    .7458109
          9  |  -.3431232   .6220309    -0.55   0.581    -1.562287    .8760407
         10  |  -1.337494   .5387575    -2.48   0.013    -2.393454   -.2815333
         11  |  -1.525899   .4950964    -3.08   0.002    -2.496314   -.5554839
         12  |  -.3499982   .5366836    -0.65   0.514    -1.401891    .7018947
         13  |  -.4511576   .5153576    -0.88   0.381    -1.461336    .5590203
         14  |   -1.33307   .4409174    -3.02   0.003    -2.197323    -.468816
         15  |  -1.277617   .5170088    -2.47   0.013    -2.290948    -.264285
         16  |  -1.373199   .4336434    -3.17   0.002    -2.223175   -.5232234
         17  |  -1.956629    .407125    -4.81   0.000    -2.754668    -1.15859
         18  |  -1.732021   .3932239    -4.40   0.000    -2.502783   -.9612592
         19  |  -1.975248   .4512347    -4.38   0.000     -2.85968   -1.090815
         20  |  -2.088357    .377862    -5.53   0.000     -2.82904   -1.347675
         21  |  -2.053657    .373151    -5.50   0.000    -2.785061   -1.322254
         22  |  -1.740714   .4883175    -3.56   0.000    -2.697817   -.7836113
         23  |  -2.641752   .3737333    -7.07   0.000    -3.374395   -1.909108
         24  |  -2.898254   .4001112    -7.24   0.000    -3.682497   -2.114012
         25  |  -2.494677   .4345796    -5.74   0.000    -3.346531   -1.642824
         26  |  -3.169773   .4235428    -7.48   0.000    -3.999932   -2.339614
         27  |  -3.304389   .4216464    -7.84   0.000     -4.13088   -2.477898
         28  |  -3.178159   .4654715    -6.83   0.000    -4.090513   -2.265806
         29  |  -3.479442   .4535373    -7.67   0.000    -4.368434    -2.59045
         30  |  -3.538509    .495097    -7.15   0.000    -4.508917   -2.568101
         31  |  -4.281857   .4953005    -8.64   0.000     -5.25266   -3.311054
         32  |   -3.72924   .5145081    -7.25   0.000    -4.737694   -2.720787
         33  |  -4.374784   .5694372    -7.68   0.000    -5.490882   -3.258687
         34  |  -4.624364   .5386965    -8.58   0.000    -5.680251   -3.568476
         35  |  -3.362182   .6459287    -5.21   0.000    -4.628188   -2.096175
         36  |  -4.905162   .6516408    -7.53   0.000    -6.182379   -3.627944
         37  |  -3.629101   .8204296    -4.42   0.000    -5.237132    -2.02107
         38  |  -5.056018   .8157157    -6.20   0.000    -6.654802   -3.457235
         39  |  -4.915913   .8606419    -5.71   0.000    -6.602783   -3.229042
------------------------------------------------------------------------------

. mat b= e(b_mi)                

. mat V = e(V_mi)

. 
. estimates save smokcenter
file smokcenter.ster saved

. 
. quietly xtlogit bismoking i.centerretire gender i.retireageg i.provinces  i.w
> orkspouse i.lastalcohol i.education i.skills lastincome i.stratum ///
> birthcohort i.lastactivity if  basmoke==1& flag==1&yrsinceretire>=-17&yrsince
> retire<=17&wave>=1991

. 
. quietly margins centerretire, atmeans asbalanced

. 
. myret
unrecognized command:  myret
r(199);

end of do-file
r(199);
