
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.0   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501406209299
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do hpc3.do 

. cd ~/git/baowen/hpc3
/gpfs/home/fas/meghir/rg684/git/baowen/hpc3

. set more 1

. cap log close

. log using log_hpc3, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc3/log_hpc3.log
  log type:  text
 opened on:  29 Jun 2017, 16:52:52

. 
. use ../EWL_mergedfiles_imputed.dta, clear

. 
. gen ageenter=agexp

. mi stset age_exitB,enter(ageenter) failure(fail=1)

     failure event:  fail == 1
obs. time interval:  (0, age_exitB]
 enter on or after:  time ageenter
 exit on or before:  failure

------------------------------------------------------------------------------
       7740  total observations
          0  exclusions
------------------------------------------------------------------------------
       7740  observations remaining, representing
       5755  failures in single-record/single-failure data
  86014.207  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =     39.58
                                          last observed exit t =     81.02

. 
. *model 5
. 
. stcrreg lastftow agexp i.tedlev i.lastgrade i.lastdepress i.lastworksp i.last
> chronic i.lastnchild i.lastconthm i.lastcarer i.lastjobdemt i.lastdeclatt i.l
> astjobsupp if sex==1& drop1!=1&drop2!=1&drop3!=1&drop4!=1, compete(exit_typeL
> ==2)

         failure _d:  fail == 1
   analysis time _t:  age_exitB
  enter on or after:  time ageenter

Iteration 0:   log pseudolikelihood = -338801.77  
Iteration 1:   log pseudolikelihood = -338727.62  
Iteration 2:   log pseudolikelihood = -338727.57  
Iteration 3:   log pseudolikelihood = -338727.57  
