
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.1   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

5-user 4-core Stata network perpetual license:
       Serial number:  501406219442
         Licensed to:  Department of Economics
                       University College London

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do hpc3.do 

. cd ~/git/baowen/hpc3
/data/uctprgu/git/baowen/hpc3

. set more 1

. cap log close

. log using log_hpc3, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /data/uctprgu/git/baowen/hpc3/log_hpc3.log
  log type:  text
 opened on:  14 Jan 2016, 04:21:16

. 
. use ../completelong, clear
(Written by R.              )

. 
. mi estimate: xtmixed dbp part1 part2 gender lastbmi  restopage i.provinces i.
> lastmarriage i.lastalcogrp i.lastsmoking i.education i.skills lastincome i.vi
> llage i.anti ///
> age1991 i.lastactivity if yearsincerehou<=17&yearsincerehou>=-17|| newhhid:||
>  idind:posiyearcenter,covariance(unstructured) mle var 

Multiple-imputation estimates                   Imputations       =         25
Mixed-effects ML regression                     Number of obs     =     17,103

-------------------------------------------------------------
                |     No. of       Observations per Group
 Group Variable |     Groups    Minimum    Average    Maximum
----------------+--------------------------------------------
        newhhid |      2,227          1        7.7         23
          idind |      2,845          1        6.0          8
-------------------------------------------------------------

                                                Average RVI       =     0.0540
                                                Largest FMI       =     0.1427
DF adjustment:   Large sample                   DF:     min       =   1,203.03
                                                        avg       =  26,572.04
                                                        max       = 236,692.46
Model F test:       Equal FMI                   F(  33,374192.1)  =      54.52
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
         dbp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       part1 |   .3807234   .0207819    18.32   0.000     .3399815    .4214654
       part2 |  -.3267607   .0381379    -8.57   0.000    -.4015181   -.2520034
      gender |  -2.483422   .4173557    -5.95   0.000    -3.301599   -1.665245
     lastbmi |   .7209773   .0425956    16.93   0.000     .6374738    .8044808
   restopage |   .0694927   .0315702     2.20   0.028     .0076137    .1313717
             |
   provinces |
          1  |   1.077733   .6482655     1.66   0.096    -.1928509    2.348316
          2  |  -3.421357   .6133842    -5.58   0.000    -4.623588   -2.219126
          3  |  -1.424149   .5778286    -2.46   0.014    -2.556696   -.2916029
          4  |  -2.844815   .5887301    -4.83   0.000    -3.998756   -1.690875
          5  |  -2.901041   .5960726    -4.87   0.000    -4.069381   -1.732702
          6  |  -3.120153   .5757531    -5.42   0.000    -4.248636   -1.991671
          7  |  -4.381263   .6012366    -7.29   0.000    -5.559703   -3.202823
          8  |  -4.814115    .600034    -8.02   0.000    -5.990174   -3.638055
             |
1.lastmarr~e |  -.3334608   .4457783    -0.75   0.454    -1.207189    .5402672
             |
 lastalcogrp |
          1  |   .3782953   .3815268     0.99   0.321    -.3695493     1.12614
          2  |   .2433202   .8108064     0.30   0.764    -1.346082    1.832722
             |
 lastsmoking |
          1  |  -.6690141   .4748403    -1.41   0.159    -1.600005    .2619767
          2  |  -.2093605   .4905897    -0.43   0.670     -1.17123    .7525095
             |
   education |
          1  |  -.7738914   .3762876    -2.06   0.040    -1.511435   -.0363477
          2  |  -.5527541   .4291172    -1.29   0.198    -1.393871    .2883622
          3  |  -1.041309   .5551973    -1.88   0.061    -2.129556    .0469385
          4  |  -.3434379    .732433    -0.47   0.639    -1.779221    1.092345
          5  |  -.9062164   .8055071    -1.13   0.261    -2.485015    .6725821
             |
      skills |
          1  |   .1277886   .4458438     0.29   0.774    -.7462241    1.001801
          2  |  -.1527758   .5752568    -0.27   0.791    -1.280616    .9750645
          3  |  -.8815158   .6412116    -1.37   0.169    -2.138326    .3752941
             |
  lastincome |  -.0079667   .0669643    -0.12   0.905    -.1392175    .1232841
   1.village |  -.0289864    .332921    -0.09   0.931    -.6815459    .6235731
      1.anti |   6.180861   .3183557    19.41   0.000     5.556546    6.805175
     age1991 |   .0248349    .026754     0.93   0.353    -.0276055    .0772753
             |
lastactivity |
          1  |  -.3216835   .4442042    -0.72   0.469    -1.192468    .5491014
          2  |  -.3970641    .513536    -0.77   0.439    -1.403846    .6097177
          3  |  -.4398928   .4971989    -0.88   0.376    -1.414638    .5348525
             |
       _cons |   56.44757   1.986144    28.42   0.000     52.55437    60.34077
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
newhhid: Identity            |
                   sd(_cons) |   2.424483   .4394691      1.699153     3.45944
-----------------------------+------------------------------------------------
idind: Unstructured          |
                sd(posiye~r) |   .3229387   .0186261      .2883978    .3616165
                   sd(_cons) |   6.916927   .4003677       6.17439    7.748762
        corr(posiye~r,_cons) |  -.7117189    .034773     -.7734495   -.6366146
-----------------------------+------------------------------------------------
                sd(Residual) |   8.946301    .060156      8.829142    9.065014
------------------------------------------------------------------------------

. 
. saveold newresult, replace
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /data/uctprgu/git/baowen/hpc3/log_hpc3.log
  log type:  text
 closed on:  14 Jan 2016, 04:59:54
-------------------------------------------------------------------------------

. 
end of do-file
