
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501306262937
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do hpc3.do 

. cd ~/git/baowen/hpc3
/gpfs/home/fas/meghir/rg684/git/baowen/hpc3

. set more 1

. cap log close

. log using log_hpc3, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc3/log_hpc3.log
  log type:  text
 opened on:  20 Feb 2017, 08:48:07

. 
. use ../imputed.dta, clear

. 
. ***************all reason, WIF, men, model 1:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp if gender==0, compete(exit_type ==2
> )
. 
. ***************all reason, WIF, men, model 2:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse if gender==0, compete(exit_type ==2)
. 
. 
. ***************all reason, WIF, women, model 1:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp if gender==1, compete(exit_type ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       2450
                                                  Average RVI     =     0.0506
                                                  Largest FMI     =     0.2032
DF adjustment:   Large sample                     DF:     min     =     596.70
                                                          avg     =   8.74e+07
                                                          max     =   2.36e+08
Model F test:       Equal FMI                     F(   5,48502.6) =       8.22
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0082038   .0154993     0.53   0.597     -.022236    .0386436
_Ixage_qgp_2 |  -.0042525   .0686135    -0.06   0.951    -.1387325    .1302276
_Ixage_qgp_3 |   .1746612    .074283     2.35   0.019     .0290692    .3202531
_Ixage_qgp_4 |   .3186381    .076581     4.16   0.000      .168542    .4687343
_Ixage_qgp_5 |   .5725516   .1216282     4.71   0.000     .3341647    .8109384
------------------------------------------------------------------------------

. 
. ***************all reason, WIF, women, model 2:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse if gender==1, compete(exit_type ==2)
. 
. 
. 
. saveold newresult, replace
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc3/log_hpc3.log
  log type:  text
 closed on:  20 Feb 2017, 08:53:48
-------------------------------------------------------------------------------

. 
end of do-file
