
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.1   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

5-user 4-core Stata network perpetual license:
       Serial number:  501406219442
         Licensed to:  Department of Economics
                       University College London

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do hpc3.do 

. cd ~/git/baowen/hpc3
/data/uctprgu/git/baowen/hpc3

. set more 1

. cap log close

. log using log_hpc3, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /data/uctprgu/git/baowen/hpc3/log_hpc3.log
  log type:  text
 opened on:   3 Jan 2016, 13:56:11

. 
. use ../statacomplete, clear
(Written by R.              )

. 
. xi:mim,cat(fit):gllamm alcogrp part1 part2 logmettotal gender lastbmi retirea
> ge i.provinces i.spstatus i.lastsmoking i.education i.skills lastincome index
>  ///
> age1991 if yearcenter<=17& yearcenter>=-17&w2>1993, i(idind newhhid) link(mlo
> git) family(binom) 
i.provinces       _Iprovinces_0-8     (naturally coded; _Iprovinces_0 omitted)
i.spstatus        _Ispstatus_0-2      (naturally coded; _Ispstatus_0 omitted)
i.lastsmoking     _Ilastsmoki_1-3     (naturally coded; _Ilastsmoki_1 omitted)
i.education       _Ieducation_0-5     (naturally coded; _Ieducation_0 omitted)
i.skills          _Iskills_0-3        (naturally coded; _Iskills_0 omitted)
[note: using mi-style format variables _mi_id and _mi_m]

Multiple-imputation estimates (gllamm)                   Imputations =      25
gllamm model                                             Minimum obs =    3466
                                                         Minimum dof =   339.3

------------------------------------------------------------------------------
     alcogrp |     Coef.  Std. Err.     t    P>|t|    [95% Conf. Int.]     FMI
-------------+----------------------------------------------------------------
c1           |
       part1 |  -.067988   .022855   -2.97   0.003   -.112791 -.023185   0.047
       part2 |   .042068    .03542    1.19   0.235   -.027357  .111494   0.025
 logmettotal |   .097432   .020779    4.69   0.000    .056588  .138276   0.208
      gender |  -3.43917   .292327  -11.76   0.000   -4.01221 -2.86614   0.045
     lastbmi |   .032188   .034327    0.94   0.348     -.0351  .099476   0.040
   retireage |  -.041966   .033868   -1.24   0.215    -.10835  .024417   0.024
_Iprovince~1 |   .026913    .42745    0.06   0.950   -.810907  .864733   0.023
_Iprovince~2 |  -.408082   .384984   -1.06   0.289   -1.16266  .346493   0.019
_Iprovince~3 |   .686228   .387444    1.77   0.077   -.073169  1.44562   0.020
_Iprovince~4 |   .514896   .480942    1.07   0.284   -.427787  1.45758   0.028
_Iprovince~5 |  -.076146   .450654   -0.17   0.866   -.959439  .807147   0.021
_Iprovince~6 |   -1.2604   .414517   -3.04   0.002   -2.07285 -.447944   0.015
_Iprovince~7 |  -.547658   .457511   -1.20   0.231   -1.44445   .34913   0.036
_Iprovince~8 |  -.859962   .458754   -1.87   0.061   -1.75911  .039188   0.011
_Ispstatus_1 |   .127468   .229574    0.56   0.579   -.322549  .577484   0.043
_Ispstatus_2 |  -.010441   .408655   -0.03   0.980   -.811409  .790527   0.018
_Ilastsmok~2 |   1.10811   .252998    4.38   0.000    .612212  1.60401   0.030
_Ilastsmok~3 |   .366347   .463507    0.79   0.429   -.542315  1.27501   0.056
_Ieducatio~1 |  -.036586   .423489   -0.09   0.931   -.866623  .793451   0.015
_Ieducatio~2 |   .080063    .41091    0.19   0.846   -.725327  .885454   0.019
_Ieducatio~3 |   .201509    .43736    0.46   0.645   -.655731  1.05875   0.022
_Ieducatio~4 |   .294164   .468748    0.63   0.530   -.624601  1.21293   0.023
_Ieducatio~5 |   .187221   .496841    0.38   0.706   -.786606  1.16105   0.023
  _Iskills_1 |  -.043599   .398361   -0.11   0.913   -.824449  .737252   0.037
  _Iskills_2 |    -.1693   .429943   -0.39   0.694   -1.01207  .673465   0.039
  _Iskills_3 |   .064864   .437483    0.15   0.882   -.792674  .922402   0.038
  lastincome |   .113789   .077896    1.46   0.144   -.038924  .266502   0.061
       index |   .003647   .006494    0.56   0.574   -.009083  .016378   0.041
     age1991 |   .013976   .029502    0.47   0.636    -.04385  .071802   0.026
       _cons |    .32088   1.75429    0.18   0.855   -3.11757  3.75933   0.021
-------------+----------------------------------------------------------------
c2           |
       part1 |  -.040581   .028696   -1.41   0.157   -.096849  .015686   0.078
       part2 |  -.069612   .046227   -1.51   0.132   -.160233  .021009   0.053
 logmettotal |   .085121   .025713    3.31   0.001    .034545  .135697   0.233
      gender |  -3.87759   .354508  -10.94   0.000   -4.57264 -3.18254   0.068
     lastbmi |   .057828   .038731    1.49   0.136   -.018123  .133779   0.086
   retireage |  -.092632   .037354   -2.48   0.013   -.165848 -.019416   0.030
_Iprovince~1 |   -.31521   .464431   -0.68   0.497   -1.22553  .595114   0.029
_Iprovince~2 |  -.858692   .415753   -2.07   0.039   -1.67357  -.04381   0.019
_Iprovince~3 |   .172028   .417614    0.41   0.680   -.646515  .990571   0.025
_Iprovince~4 |  -.940418   .589909   -1.59   0.111   -2.09698  .216144   0.067
_Iprovince~5 |  -.434066   .482067   -0.90   0.368   -1.37894  .510809   0.025
_Iprovince~6 |   -1.4562   .445633   -3.27   0.001   -2.32965 -.582741   0.021
_Iprovince~7 |  -.964796   .500971   -1.93   0.054   -1.94682  .017226   0.044
_Iprovince~8 |  -1.96551   .522748   -3.76   0.000   -2.99008 -.940931   0.011
_Ispstatus_1 |  -.175544   .250248   -0.70   0.483     -.6661  .315012   0.048
_Ispstatus_2 |   .425591   .433044    0.98   0.326   -.423169  1.27435   0.012
_Ilastsmok~2 |   1.62487   .274475    5.92   0.000    1.08683  2.16291   0.045
_Ilastsmok~3 |   .503519   .506911    0.99   0.321   -.490183  1.49722   0.050
_Ieducatio~1 |  -.124079   .457915   -0.27   0.786    -1.0216  .773446   0.021
_Ieducatio~2 |   .008514   .445124    0.02   0.985   -.863937  .880964   0.019
_Ieducatio~3 |   .358304   .472579    0.76   0.448   -.567963  1.28457   0.021
_Ieducatio~4 |  -.316027   .525632   -0.60   0.548   -1.34636  .714311   0.040
_Ieducatio~5 |  -.062973   .546903   -0.12   0.908   -1.13496  1.00901   0.032
  _Iskills_1 |  -.655627   .430216   -1.52   0.128   -1.49923   .18798   0.082
  _Iskills_2 |  -.708141     .4619   -1.53   0.125   -1.61382  .197535   0.076
  _Iskills_3 |  -.306003   .474021   -0.65   0.519   -1.23554   .62353   0.085
  lastincome |   .110985   .086034    1.29   0.197   -.057701  .279671   0.072
       index |  -.010974   .007177   -1.53   0.126   -.025045  .003097   0.066
     age1991 |   .044371   .032725    1.36   0.175   -.019773  .108516   0.034
       _cons |   2.16034   1.97955    1.09   0.275   -1.72069  6.04137   0.066
-------------+----------------------------------------------------------------
idin1        |
       _cons |   1.44183   .257373    5.60   0.000    .937268   1.9464   0.059
-------------+----------------------------------------------------------------
newh2        |
       _cons |    1.2765   .287959    4.43   0.000    .711909  1.84109   0.072
------------------------------------------------------------------------------


. 
. saveold newresult, replace
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /data/uctprgu/git/baowen/hpc3/log_hpc3.log
  log type:  text
 closed on:   6 Jan 2016, 02:20:40
-------------------------------------------------------------------------------

. 
end of do-file
