-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc3/log_hpc3.log
  log type:  text
 opened on:  13 Feb 2017, 15:20:35

. 
. use ../imputed.dta, clear

. 
. 
. **************************all reason, FIW, not early, model 1:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender if early==0, compete(exit_
> type ==2)
. ***************************all reason, FIW, not early, model 2:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse if i.early==0, compete(exit_type ==2)
. **************************all reason, FIW, early, model 1:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender if early==1, compete(exit_t
> ype ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       3502
                                                  Average RVI     =     0.0239
                                                  Largest FMI     =     0.1069
DF adjustment:   Large sample                     DF:     min     =    2131.88
                                                          avg     =   1.30e+09
                                                          max     =   2.79e+09
Model F test:       Equal FMI                     F(   5,206839.6)=      11.12
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0123857   .0124957     0.99   0.322    -.0121193    .0368907
_Ixage_qgp_2 |   .2284384   .0463384     4.93   0.000     .1376168      .31926
_Ixage_qgp_3 |   .3191984   .0533161     5.99   0.000     .2147007    .4236962
_Ixage_qgp_4 |   .1963886   .0634041     3.10   0.002     .0721188    .3206584
_Ixage_qgp_5 |          0  (omitted)
  _Igender_1 |   .1252299   .0418031     3.00   0.003     .0432974    .2071625
------------------------------------------------------------------------------

. **************************all reason, FIW, early, model 2:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse if i.early==1, compete(exit_type ==2)
. 
. 
. saveold newresult, replace
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc3/log_hpc3.log
  log type:  text
 closed on:  13 Feb 2017, 15:32:25
-------------------------------------------------------------------------------
