-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc3/log_hpc3.log
  log type:  text
 opened on:   8 Feb 2017, 07:43:07

. 
. use ../imputed.dta, clear

. 
. ***************retired
. *mi stset age_exitnew, failure(exit_type==3) enter(xage_q)exit (age_exitnew=7
> 5)
. *model 1:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 4 5
>  6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 4 5
>  6)
. *mode1 2:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse , compete(exit_type ==2 4 5 6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse, compete(exit_type ==2 4 5 6)
. *model 3:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  4 5 6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  4 5 6)
. 
. ***************unemployed
. *mi stset age_exitnew, failure(exit_type==4) enter(xage_q)exit (age_exitnew=7
> 5)
. *model 1:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 3 5
>  6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 3 5
>  6)
. 
. *mode1 2:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse , compete(exit_type ==2 3 5 6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse, compete(exit_type ==2 3 5 6)
. *model 3:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  3 5 6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  3 5 6)
. 
. ***************health reason
. mi stset age_exitnew, failure(exit_type==5) enter(xage_q)exit (age_exitnew=75
> )

     failure event:  exit_type == 5
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
      557  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. *model 1:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 3 4
>  6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 3 4
>  6)
. *mode1 2:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse , compete(exit_type ==2 3 4 6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse, compete(exit_type ==2 3 4 6)
. *model 3:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  3 4 6)
. xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2 
> 3 4 6)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)
i.xdeclatt        _Ixdeclatt_0-2      (naturally coded; _Ixdeclatt_0 omitted)
i.xjobdemt        _Ixjobdemt_0-2      (naturally coded; _Ixjobdemt_0 omitted)
i.support         _Isupport_0-2       (naturally coded; _Isupport_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       7913
                                                  Average RVI     =     0.0708
                                                  Largest FMI     =     0.1773
DF adjustment:   Large sample                     DF:     min     =     781.95
                                                          avg     =  500198.79
                                                          max     = 5887430.62
Model F test:       Equal FMI                     F(  21,113477.1)=      18.24
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        wtof |   .0246396   .0327835     0.75   0.453    -.0397052    .0889845
_Ixage_qgp_2 |   .6645527    .127614     5.21   0.000     .4144337    .9146716
_Ixage_qgp_3 |   1.109609   .1383572     8.02   0.000     .8384336    1.380784
_Ixage_qgp_4 |   1.238687   .1582271     7.83   0.000     .9285674    1.548807
_Ixage_qgp_5 |   1.809236   .2942051     6.15   0.000     1.232603    2.385869
  _Igender_1 |  -.0604188   .1032432    -0.59   0.558    -.2627719    .1419343
  _Itedlev_1 |  -.1314159    .122653    -1.07   0.284    -.3718727     .109041
  _Itedlev_2 |   .0148464   .1234182     0.12   0.904    -.2271044    .2567972
_Ixrgrlump_1 |   .5441304   .1393564     3.90   0.000     .2709906    .8172701
_Ixrgrlump_2 |   1.028628   .1892852     5.43   0.000     .6576126    1.399644
 _Idepress_1 |   .5826638   .0970599     6.00   0.000     .3924078    .7729198
 _Ichronic_1 |    .439593   .1020577     4.31   0.000     .2394531    .6397328
 _Ichronic_2 |   .8377536   .1675315     5.00   0.000     .5088889    1.166618
  _Ispouse_1 |   .0431559    .121754     0.35   0.723    -.1954846    .2817964
  _Ispouse_2 |   .2197186   .0985633     2.23   0.026      .026524    .4129132
_Ixdeclatt_1 |  -.2782579   .1171337    -2.38   0.018    -.5079671   -.0485487
_Ixdeclatt_2 |  -.5611903   .1450264    -3.87   0.000    -.8455312   -.2768493
_Ixjobdemt_1 |   .0558074   .1188019     0.47   0.639    -.1772179    .2888327
_Ixjobdemt_2 |   .0747577   .1450093     0.52   0.606    -.2096254    .3591408
 _Isupport_1 |  -.0171445   .1145649    -0.15   0.881    -.2417315    .2074426
 _Isupport_2 |  -.0637222   .1184972    -0.54   0.591    -.2960754    .1686309
------------------------------------------------------------------------------

. 
. 
. ***************other
. *mi stset age_exitnew, failure(exit_type==6) enter(xage_q)exit (age_exitnew=7
> 5)
. *model 1:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 3 4
>  5)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 3 4
>  5)
. *mode1 2:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse , compete(exit_type ==2 3 4 5)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse, compete(exit_type ==2 3 4 5)
. *model 3:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  3 4 5)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  3 4 5)
. 
. 
. saveold newresult, replace
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc3/log_hpc3.log
  log type:  text
 closed on:   8 Feb 2017, 17:06:27
-------------------------------------------------------------------------------
