-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc2/log_hpc2.log
  log type:  text
 opened on:  29 Jun 2017, 19:05:24

. 
. use ../EWL_mergedfiles_imputed.dta, clear

. 
. gen ageenter=agexp

. mi stset age_exitB,enter(ageenter) failure(fail=1)

     failure event:  fail == 1
obs. time interval:  (0, age_exitB]
 enter on or after:  time ageenter
 exit on or before:  failure

------------------------------------------------------------------------------
       7740  total observations
          0  exclusions
------------------------------------------------------------------------------
       7740  observations remaining, representing
       5755  failures in single-record/single-failure data
  86014.207  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =     39.58
                                          last observed exit t =     81.02

. 
. *model 4
. 
. mi estimate,hr:stcrreg lastftow agexp i.tedlev i.lastgrade i.lastdepress i.la
> stworksp i.lastchronic i.lastnchild i.lastconthm i.lastcarer if sex==1& drop1
> !=1&drop2!=1&drop3!=1&drop4!=1, compete(exit_typeL==2)
note: option shr is assumed

Multiple-imputation estimates                   Imputations       =         25
Competing-risks regression                      Number of obs     =      5,406
                                                Average RVI       =     0.0468
                                                Largest FMI       =     0.1986
DF adjustment:   Large sample                   DF:     min       =     624.20
                                                        avg       = 775,820.95
                                                        max       = 5530290.31
Model F test:       Equal FMI                   F(  20,236362.8)  =      13.63
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
          _t |        SHR   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lastftow |   .9885496   .0107981    -1.05   0.292     .9676099    1.009942
       agexp |   1.010876   .0034409     3.18   0.001     1.004155    1.017643
             |
      tedlev |
A level o..  |   .9625705   .0413721    -0.89   0.375      .884786    1.047193
Degree le..  |   .8330508   .0340572    -4.47   0.000      .768894    .9025609
             |
   lastgrade |
          2  |    1.11046   .0399859     2.91   0.004     1.034791    1.191664
          3  |   .8475239   .0591724    -2.37   0.018     .7391325    .9718104
             |
 lastdepress |
 1 yes, h..  |   1.378691   .0761005     5.82   0.000      1.23732    1.536215
             |
  lastworksp |
          1  |   .7983032   .0390732    -4.60   0.000     .7251729    .8788083
          2  |   .7652682    .045071    -4.54   0.000     .6816857    .8590988
             |
 lastchronic |
          1  |   .6665451   .0277616    -9.74   0.000     .6142949    .7232395
          2  |   .5431611   .0655989    -5.05   0.000     .4286738    .6882248
             |
  lastnchild |
          1  |   1.194885   .0622322     3.42   0.001      1.07888    1.323363
          2  |   1.212397   .0677458     3.45   0.001     1.086603    1.352754
          3  |   1.023284   .0885863     0.27   0.790     .8635684    1.212539
             |
  lastconthm |
          2  |   .9886761   .1556047    -0.07   0.942     .7262497    1.345929
          3  |   .8909326   .1407257    -0.73   0.465     .6537241    1.214214
          4  |   .9587067   .1457645    -0.28   0.782     .7116501    1.291531
          5  |   1.133403   .1627712     0.87   0.383     .8553443    1.501855
          6  |   1.210867   .1753578     1.32   0.186     .9116438    1.608302
             |
 1.lastcarer |   1.169793   .0599774     3.06   0.002     1.057952    1.293456
------------------------------------------------------------------------------

. mi estimate,hr:stcrreg lastftow agexp i.tedlev i.lastgrade i.lastdepress i.la
> stworksp i.lastchronic i.lastnchild i.lastconthm i.lastcarer if sex==2& drop1
> !=1&drop2!=1&drop3!=1&drop4!=1, compete(exit_typeL==2)
note: option shr is assumed

Multiple-imputation estimates                   Imputations       =         25
Competing-risks regression                      Number of obs     =      2,334
                                                Average RVI       =     0.0522
                                                Largest FMI       =     0.2102
DF adjustment:   Large sample                   DF:     min       =     558.23
                                                        avg       = 920,531.47
                                                        max       = 5820216.10
Model F test:       Equal FMI                   F(  20,191717.1)  =       8.10
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
          _t |        SHR   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lastftow |   1.038983   .0165169     2.41   0.016     1.007106     1.07187
       agexp |   1.013666   .0047606     2.89   0.004     1.004378    1.023039
             |
      tedlev |
A level o..  |   1.063653   .0700598     0.94   0.349     .9348053    1.210261
Degree le..  |    .810635   .0571498    -2.98   0.003     .7059918    .9307886
             |
   lastgrade |
          2  |   1.204023   .0869864     2.57   0.010     1.045048    1.387181
          3  |   1.150557   .0887215     1.82   0.069     .9891635    1.338284
             |
 lastdepress |
 1 yes, h..  |   1.169408   .0808372     2.26   0.024     1.021218    1.339103
             |
  lastworksp |
          1  |   .9222886   .0499706    -1.49   0.136     .8291776    1.025855
          2  |   .8692226   .1101913    -1.11   0.269     .6776845    1.114896
             |
 lastchronic |
          1  |   .6277123   .0417626    -7.00   0.000     .5509714    .7151419
          2  |   .5163091   .0827279    -4.13   0.000      .377157    .7068015
             |
  lastnchild |
          1  |    1.32761   .1025255     3.67   0.000     1.141101    1.544604
          2  |   1.615351      .2037     3.80   0.000     1.261569    2.068344
          3  |   1.303306   .2166171     1.59   0.111     .9408481    1.805401
             |
  lastconthm |
          2  |   .9186556   .1931999    -0.40   0.687     .6083294    1.387288
          3  |   .8068928   .1697261    -1.02   0.308     .5342806    1.218603
          4  |   .8301903   .1660725    -0.93   0.352     .5609214    1.228721
          5  |   1.131742   .2006972     0.70   0.485     .7994659    1.602121
          6  |   1.046938    .186964     0.26   0.797     .7377543    1.485696
             |
 1.lastcarer |   1.113841    .079304     1.51   0.130     .9687655    1.280642
------------------------------------------------------------------------------

. mi estimate,hr:stcrreg lastwtof agexp i.tedlev i.lastgrade i.lastdepress i.la
> stworksp i.lastchronic i.lastnchild i.lastconthm i.lastcarer if sex==1& drop1
> !=1&drop2!=1&drop3!=1&drop4!=1, compete(exit_typeL==2)
note: option shr is assumed

Multiple-imputation estimates                   Imputations       =         25
Competing-risks regression                      Number of obs     =      5,406
                                                Average RVI       =     0.0478
                                                Largest FMI       =     0.1895
DF adjustment:   Large sample                   DF:     min       =     685.44
                                                        avg       = 686,595.37
                                                        max       = 4785441.69
Model F test:       Equal FMI                   F(  20,227295.8)  =      13.89
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
          _t |        SHR   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lastwtof |   1.032761   .0099552     3.34   0.001      1.01343     1.05246
       agexp |   1.011813   .0034576     3.44   0.001     1.005059    1.018613
             |
      tedlev |
A level o..  |   .9540276   .0410221    -1.09   0.274     .8769028    1.037936
Degree le..  |   .8257017   .0338115    -4.68   0.000     .7620108     .894716
             |
   lastgrade |
          2  |   1.140233   .0418719     3.57   0.000     1.061049    1.225327
          3  |   .8860579   .0627754    -1.71   0.088       .77118    1.018048
             |
 lastdepress |
 1 yes, h..  |   1.357268   .0745161     5.56   0.000       1.2188    1.511467
             |
  lastworksp |
          1  |   .7870432   .0389022    -4.84   0.000     .7142702    .8672306
          2  |   .7543125   .0443774    -4.79   0.000     .6720247    .8466763
             |
 lastchronic |
          1  |   .6658833   .0277926    -9.74   0.000     .6135792     .722646
          2  |   .5353384   .0648189    -5.16   0.000     .4222452    .6787222
             |
  lastnchild |
          1  |   1.185689   .0618993     3.26   0.001      1.07032    1.313493
          2  |   1.200921   .0668563     3.29   0.001     1.076754    1.339406
          3  |   1.009989    .087572     0.11   0.909     .8521234    1.197102
             |
  lastconthm |
          2  |   .9904318   .1565288    -0.06   0.951     .7266074    1.350048
          3  |   .9023763   .1431342    -0.65   0.517     .6612572    1.231416
          4  |   .9659264   .1476224    -0.23   0.821     .7159041    1.303267
          5  |    1.16861   .1685015     1.08   0.280     .8809171    1.550259
          6  |   1.262689     .18335     1.61   0.108     .9499407    1.678402
             |
 1.lastcarer |   1.152328   .0586079     2.79   0.005     1.042998    1.273119
------------------------------------------------------------------------------

. mi estimate,hr:stcrreg lastwtof agexp i.tedlev i.lastgrade i.lastdepress i.la
> stworksp i.lastchronic i.lastnchild i.lastconthm i.lastcarer if sex==2& drop1
> !=1&drop2!=1&drop3!=1&drop4!=1, compete(exit_typeL==2)
note: option shr is assumed

Multiple-imputation estimates                   Imputations       =         25
Competing-risks regression                      Number of obs     =      2,334
                                                Average RVI       =     0.0546
                                                Largest FMI       =     0.2044
DF adjustment:   Large sample                   DF:     min       =     589.79
                                                        avg       = 568,644.72
                                                        max       = 2838594.85
Model F test:       Equal FMI                   F(  20,176210.0)  =       8.83
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
          _t |        SHR   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lastwtof |   1.072518   .0165051     4.55   0.000     1.040642    1.105369
       agexp |   1.015237   .0047759     3.21   0.001      1.00592    1.024641
             |
      tedlev |
A level o..  |   1.049442   .0693431     0.73   0.465     .9219382    1.194579
Degree le..  |   .8056019   .0568835    -3.06   0.002     .7014573    .9252086
             |
   lastgrade |
          2  |   1.275158   .0934157     3.32   0.001     1.104597    1.472055
          3  |   1.257863   .1009367     2.86   0.004     1.074794    1.472115
             |
 lastdepress |
 1 yes, h..  |    1.14489    .079244     1.95   0.051     .9996336    1.311254
             |
  lastworksp |
          1  |    .910649   .0488931    -1.74   0.082     .8195202    1.011911
          2  |   .8575875   .1090116    -1.21   0.227     .6681225    1.100781
             |
 lastchronic |
          1  |   .6362304   .0425872    -6.76   0.000     .5580045    .7254226
          2  |   .5119576   .0822209    -4.17   0.000     .3737058    .7013554
             |
  lastnchild |
          1  |    1.32924   .1024703     3.69   0.000     1.142803    1.546092
          2  |   1.579611   .2034569     3.55   0.000      1.22715    2.033306
          3  |   1.356021   .2241246     1.84   0.065     .9806535    1.875068
             |
  lastconthm |
          2  |   .8961797   .1911062    -0.51   0.607     .5900381    1.361163
          3  |   .7965865   .1703331    -1.06   0.288     .5238673     1.21128
          4  |   .8234507   .1668124    -0.96   0.338     .5536094    1.224818
          5  |   1.123218    .202389     0.64   0.519     .7890214    1.598967
          6  |   1.041352   .1886969     0.22   0.823     .7300559    1.485384
             |
 1.lastcarer |   1.145547   .0797183     1.95   0.051     .9994892    1.312949
------------------------------------------------------------------------------

. 
. 
. 
. saveold newresult, replace
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc2/log_hpc2.log
  log type:  text
 closed on:  29 Jun 2017, 22:25:43
-------------------------------------------------------------------------------
