
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501306262937
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do hpc.do 

. cd ~/git/baowen/hpc
/gpfs/home/fas/meghir/rg684/git/baowen/hpc

. set more 1

. cap log close

. log using log_hpc, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc/log_hpc.log
  log type:  text
 opened on:   2 Feb 2017, 18:09:34

. 
. use ../imputed.dta, clear

. 
. ***************retired
. mi stset age_exitnew, failure(exit_type==3) enter(xage_q)exit (age_exitnew=75
> )

     failure event:  exit_type == 3
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     4678  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. *model 1:
. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 4 5 
> 6)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       7913
                                                  Average RVI     =     0.0138
                                                  Largest FMI     =     0.0728
DF adjustment:   Large sample                     DF:     min     =    4577.15
                                                          avg     =   6.52e+07
                                                          max     =   2.69e+08
Model F test:       Equal FMI                     F(   6,735409.8)=      75.51
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |  -.0499349   .0096819    -5.16   0.000    -.0689161   -.0309536
_Ixage_qgp_2 |   .1144011   .0425663     2.69   0.007     .0309727    .1978296
_Ixage_qgp_3 |   .2237586   .0460808     4.86   0.000     .1334418    .3140753
_Ixage_qgp_4 |   .6814505   .0451504    15.09   0.000     .5929573    .7699438
_Ixage_qgp_5 |   1.031153   .0790551    13.04   0.000      .876208    1.186098
  _Igender_1 |   .0168792    .031289     0.54   0.590    -.0444461    .0782046
------------------------------------------------------------------------------

. xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 4 5 
> 6)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       7913
                                                  Average RVI     =     0.0209
                                                  Largest FMI     =     0.1119
DF adjustment:   Large sample                     DF:     min     =    1948.41
                                                          avg     =   1.36e+08
                                                          max     =   6.86e+08
Model F test:       Equal FMI                     F(   6,323903.9)=      70.70
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        wtof |  -.0115568   .0087263    -1.32   0.186    -.0286707     .005557
_Ixage_qgp_2 |    .119022   .0425011     2.80   0.005     .0357213    .2023227
_Ixage_qgp_3 |   .2370172   .0460328     5.15   0.000     .1467945    .3272399
_Ixage_qgp_4 |   .7025522   .0450323    15.60   0.000     .6142905    .7908138
_Ixage_qgp_5 |   1.054989   .0789305    13.37   0.000     .9002884     1.20969
  _Igender_1 |   .0064758   .0322586     0.20   0.841    -.0567499    .0697016
------------------------------------------------------------------------------

. *mode1 2:
. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse , compete(exit_type ==2 4 5 6)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       7913
                                                  Average RVI     =     0.0328
                                                  Largest FMI     =     0.0806
DF adjustment:   Large sample                     DF:     min     =    3740.44
                                                          avg     = 1392733.40
                                                          max     =   1.13e+07
Model F test:       Equal FMI                     F(  15,348325.4)=      36.84
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |  -.0494196   .0101524    -4.87   0.000    -.0693239   -.0295152
_Ixage_qgp_2 |   .1019178   .0432534     2.36   0.018     .0171428    .1866928
_Ixage_qgp_3 |   .2184181   .0472466     4.62   0.000     .1258163    .3110199
_Ixage_qgp_4 |   .7003085   .0467583    14.98   0.000      .608664    .7919531
_Ixage_qgp_5 |   1.062605   .0809777    13.12   0.000     .9038914    1.221319
  _Igender_1 |    .124069   .0360712     3.44   0.001     .0533707    .1947674
  _Itedlev_1 |   .0300901   .0397274     0.76   0.449    -.0477873    .1079675
  _Itedlev_2 |  -.2074559   .0396728    -5.23   0.000    -.2852243   -.1296875
_Ixrgrlump_1 |  -.1096137   .0359876    -3.05   0.002    -.1801485    -.039079
_Ixrgrlump_2 |  -.4588181   .0512187    -8.96   0.000    -.5592059   -.3584302
 _Idepress_1 |  -.0796117   .0406318    -1.96   0.050    -.1592556    .0000322
 _Ichronic_1 |  -.0502486   .0362118    -1.39   0.165    -.1212454    .0207481
 _Ichronic_2 |   -.026028   .0716189    -0.36   0.716    -.1664424    .1143864
  _Ispouse_1 |  -.0553233   .0371617    -1.49   0.137    -.1281604    .0175138
  _Ispouse_2 |   .0138309   .0358463     0.39   0.700    -.0564296    .0840913
------------------------------------------------------------------------------

. xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse, compete(exit_type ==2 4 5 6)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)
