
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.1   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

5-user 4-core Stata network perpetual license:
       Serial number:  501406219442
         Licensed to:  Department of Economics
                       University College London

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do hpc.do 

. cd ~/git/baowen/hpc
/data/uctprgu/git/baowen/hpc

. set more 1

. cap log close

. log using log_hpc, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /data/uctprgu/git/baowen/hpc/log_hpc.log
  log type:  text
 opened on:  16 Dec 2016, 18:20:16

. 
. 
. use ../usinglong_MI.dta, clear

. 
. keep if oddwave==1& anasample==1&part==1
(46,979 observations deleted)

. mi set  mlong

. mi xtset,clear

. set matsize 10000

. 
. 
. mi register imputed sex birth stopage edlev lastgrade lastspwor esmoke alcoho
> l sbp dbp bmi blchol everchd everstroke evermi evercancer everdiabe ///
> pcs ghqgp age reasonstop labstatnew dead wave yeartostop ah4 mem mh swords an
> imals part1 part2 ah4mi memmi mhmi swordsmi animalsmi inter1 inter2
(3841 m=0 obs. now marked as incomplete)

. 
. 
. mi impute chained ///
> (regress) sbp dbp bmi pcs ///
> (mlogit) lastspwor ///
> (ologit) edlev alcohol esmoke ///
> (logit) ghqgp ///
> (pmm, knn(5))blchol ah4mi memmi mhmi swordsmi animalsmi=sex birth stopage las
> tgrade everchd everstroke evermi evercancer everdiabe ///
> age reasonstop dead wave yeartostop part1 part2 inter1 inter2,add(30)burnin(2
> 0) rseed(1389)augment
I/O error writing .dta file
    Usually such I/O errors are caused by the disk or file system being full.
r(693);

end of do-file
r(693);
