
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501306262937
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do hpc.do 

. cd ~/git/baowen/hpc
/gpfs/home/fas/meghir/rg684/git/baowen/hpc

. set more 1

. cap log close

. log using log_hpc, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc/log_hpc.log
  log type:  text
 opened on:  21 Feb 2017, 10:06:01

. 
. use ../imputed.dta, clear

. 
. ***************all reason, FIW, Administrative, women, model 1:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp  if xrgrlump==0&gender==1, compete(e
> xit_type ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =        394
                                                  Average RVI     =     0.0144
                                                  Largest FMI     =     0.0649
DF adjustment:   Large sample                     DF:     min     =    5752.67
                                                          avg     =   6.63e+08
                                                          max     =   3.29e+09
Model F test:       Equal FMI                     F(   5,557390.4)=       0.72
Within VCE type:       Robust                     Prob > F        =     0.6117

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |  -.0227666   .0341758    -0.67   0.505     -.089764    .0442308
_Ixage_qgp_2 |  -.1612273   .1379133    -1.17   0.242    -.4315324    .1090778
_Ixage_qgp_3 |  -.0145381   .1781452    -0.08   0.935    -.3636966    .3346203
_Ixage_qgp_4 |  -.0002521   .2061989    -0.00   0.999    -.4043946    .4038905
_Ixage_qgp_5 |   .4454786   .5045553     0.88   0.377    -.5434316    1.434389
------------------------------------------------------------------------------

. ***************all reason, FIW, Administrative, women,model 2:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp  i.tedlev i.xrgrlump i.depress i.chr
> onic i.spouse if xrgrlump==0&gender==1, compete(exit_type ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =        394
                                                  Average RVI     =     0.0485
                                                  Largest FMI     =     0.1082
DF adjustment:   Large sample                     DF:     min     =    2082.94
                                                          avg     =   82314.68
                                                          max     =  539753.83
Model F test:       Equal FMI                     F(  12,130808.2)=       2.35
Within VCE type:       Robust                     Prob > F        =     0.0051

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0175339   .0371762     0.47   0.637     -.055371    .0904388
_Ixage_qgp_2 |  -.2060409   .1424856    -1.45   0.148    -.4853121    .0732304
_Ixage_qgp_3 |  -.0644636    .180417    -0.36   0.721    -.4180799    .2891526
_Ixage_qgp_4 |  -.0694828   .2209179    -0.31   0.753    -.5024789    .3635132
_Ixage_qgp_5 |   .3481985   .5579034     0.62   0.533    -.7452745    1.441672
  _Itedlev_1 |   .4528556   .2028678     2.23   0.026     .0552143    .8504968
  _Itedlev_2 |  -.1196465   .1803797    -0.66   0.507    -.4732197    .2339267
_Ixrgrlump_1 |          0  (omitted)
_Ixrgrlump_2 |          0  (omitted)
 _Idepress_1 |   -.059758   .1433996    -0.42   0.677    -.3408574    .2213414
 _Ichronic_1 |  -.0944697   .1519764    -0.62   0.534    -.3924612    .2035219
 _Ichronic_2 |   .2086597   .6173953     0.34   0.735    -1.002116    1.419436
  _Ispouse_1 |  -.3260391   .1718122    -1.90   0.058    -.6627881    .0107099
  _Ispouse_2 |   .1923926   .1360343     1.41   0.157    -.0742451    .4590302
------------------------------------------------------------------------------

. ***************all reason, FIW,Prof/Exec, women,model 1:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp  if xrgrlump==1&gender==1, compete(e
> xit_type ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       1079
                                                  Average RVI     =     0.0390
                                                  Largest FMI     =     0.1645
DF adjustment:   Large sample                     DF:     min     =     906.68
                                                          avg     =   1.91e+08
                                                          max     =   7.11e+08
Model F test:       Equal FMI                     F(   5,79630.2) =      10.37
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |  -.0162209   .0224196    -0.72   0.470    -.0602213    .0277796
_Ixage_qgp_2 |   .1053665   .0951189     1.11   0.268    -.0810632    .2917962
_Ixage_qgp_3 |   .2970478   .1076384     2.76   0.006     .0860805    .5080151
_Ixage_qgp_4 |    .599906   .1064418     5.64   0.000     .3912839    .8085281
_Ixage_qgp_5 |   .8157319   .1603305     5.09   0.000     .5014899    1.129974
------------------------------------------------------------------------------

. ***************all reason, FIW, Prof/Exec,women, model 2:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp  i.tedlev i.xrgrlump i.depress i.chr
> onic i.spouse if xrgrlump==1&gender==1, compete(exit_type ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       1079
                                                  Average RVI     =     0.0628
                                                  Largest FMI     =     0.1789
DF adjustment:   Large sample                     DF:     min     =     768.13
                                                          avg     =  137172.62
                                                          max     =  865016.23
Model F test:       Equal FMI                     F(  12,80306.2) =       5.39
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |  -.0032534     .02374    -0.14   0.891    -.0498564    .0433496
_Ixage_qgp_2 |   .0584247   .0954613     0.61   0.541    -.1286762    .2455257
_Ixage_qgp_3 |   .1993783   .1110515     1.80   0.073      -.01828    .4170366
_Ixage_qgp_4 |   .4956387   .1096688     4.52   0.000     .2806905     .710587
_Ixage_qgp_5 |    .663095   .1659027     4.00   0.000     .3379301      .98826
  _Itedlev_1 |  -.0114242   .0882082    -0.13   0.897    -.1843519    .1615034
  _Itedlev_2 |  -.2590101   .1002655    -2.58   0.010    -.4556161   -.0624041
_Ixrgrlump_1 |          0  (omitted)
_Ixrgrlump_2 |          0  (omitted)
 _Idepress_1 |  -.0097506   .0871903    -0.11   0.911    -.1806427    .1611414
 _Ichronic_1 |   .1461281   .0913561     1.60   0.110    -.0329718     .325228
 _Ichronic_2 |   .2277953   .1561925     1.46   0.145     -.078581    .5341716
  _Ispouse_1 |  -.0703244   .1150315    -0.61   0.541    -.2958474    .1551985
  _Ispouse_2 |   .1333642   .0756341     1.76   0.078    -.0148988    .2816271
------------------------------------------------------------------------------

. ***************all reason, FIW, Clerical,women, model 1:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp  if xrgrlump==2&gender==1, compete(e
> xit_type ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =        977
                                                  Average RVI     =     0.0824
                                                  Largest FMI     =     0.2926
DF adjustment:   Large sample                     DF:     min     =     289.89
                                                          avg     =  766198.15
                                                          max     = 1883534.18
Model F test:       Equal FMI                     F(   5,19392.8) =       2.69
Within VCE type:       Robust                     Prob > F        =     0.0197

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0479454   .0272256     1.76   0.079    -.0056394    .1015302
_Ixage_qgp_2 |   .0733093   .1449046     0.51   0.613    -.2106987    .3573173
_Ixage_qgp_3 |   .2713894   .1484031     1.83   0.067    -.0194761    .5622549
_Ixage_qgp_4 |   .2762036   .1524983     1.81   0.070    -.0226888     .575096
_Ixage_qgp_5 |   .4784765    .185955     2.57   0.010     .1140111    .8429419
------------------------------------------------------------------------------

. ***************all reason, FIW, Clerical,women, model 2:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp  i.tedlev i.xrgrlump i.depress i.chr
> onic i.spouse if xrgrlump==2&gender==1, compete(exit_type ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =        977
                                                  Average RVI     =     0.1226
                                                  Largest FMI     =     0.2904
DF adjustment:   Large sample                     DF:     min     =     294.19
                                                          avg     =  341849.81
                                                          max     = 2211566.59
Model F test:       Equal FMI                     F(  12,23514.9) =       1.69
Within VCE type:       Robust                     Prob > F        =     0.0623

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0498527   .0279364     1.78   0.075    -.0051278    .1048331
_Ixage_qgp_2 |    .052673   .1458845     0.36   0.718    -.2332556    .3386015
_Ixage_qgp_3 |   .2275866   .1489495     1.53   0.127    -.0643494    .5195226
_Ixage_qgp_4 |   .2111296   .1559408     1.35   0.176    -.0945095    .5167686
_Ixage_qgp_5 |   .3706919   .1933975     1.92   0.055     -.008362    .7497457
  _Itedlev_1 |  -.1415597   .1349179    -1.05   0.294    -.4062752    .1231559
  _Itedlev_2 |  -.1159639   .1312145    -0.88   0.377    -.3737428     .141815
_Ixrgrlump_1 |          0  (omitted)
_Ixrgrlump_2 |          0  (omitted)
 _Idepress_1 |   .0170642   .0934039     0.18   0.855    -.1660553    .2001837
 _Ichronic_1 |   .0444442   .0914609     0.49   0.627    -.1348623    .2237507
 _Ichronic_2 |   .3776962    .164816     2.29   0.022     .0544084    .7009841
  _Ispouse_1 |   .1709606     .17091     1.00   0.317    -.1641448     .506066
  _Ispouse_2 |    .006137    .084825     0.07   0.942    -.1604337    .1727076
------------------------------------------------------------------------------

. 
. 
. 
. saveold newresult, replace
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc/log_hpc.log
  log type:  text
 closed on:  21 Feb 2017, 10:15:36
-------------------------------------------------------------------------------

. 
end of do-file
