
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501306262937
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do hpc.do 

. cd ~/git/baowen/hpc
/gpfs/home/fas/meghir/rg684/git/baowen/hpc

. set more 1

. cap log close

. log using log_hpc, text replace
(note: file /gpfs/home/fas/meghir/rg684/git/baowen/hpc/log_hpc.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc/log_hpc.log
  log type:  text
 opened on:   5 Feb 2017, 19:26:31

. 
. use ../imputed.dta, clear

. 
. ***************retired
. mi stset age_exitnew, failure(exit_type==3) enter(xage_q)exit (age_exitnew=75
> )

     failure event:  exit_type == 3
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     4678  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. *model 1:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 4 5
>  6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 4 5
>  6)
. *mode1 2:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse , compete(exit_type ==2 4 5 6)
. xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse, compete(exit_type ==2 4 5 6)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       7913
                                                  Average RVI     =     0.0360
                                                  Largest FMI     =     0.1268
DF adjustment:   Large sample                     DF:     min     =    1519.12
                                                          avg     = 1641443.07
                                                          max     =   1.04e+07
Model F test:       Equal FMI                     F(  15,292285.8)=      36.12
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        wtof |  -.0313859   .0098983    -3.17   0.002    -.0508017   -.0119701
_Ixage_qgp_2 |   .1024275   .0432143     2.37   0.018      .017729    .1871261
_Ixage_qgp_3 |    .224329   .0472391     4.75   0.000     .1317419    .3169161
_Ixage_qgp_4 |   .7102181   .0467035    15.21   0.000     .6186808    .8017554
_Ixage_qgp_5 |   1.069726   .0809031    13.22   0.000     .9111588    1.228293
  _Igender_1 |   .1110262   .0359068     3.09   0.002     .0406501    .1814023
  _Itedlev_1 |    .031119   .0397152     0.78   0.433     -.046734    .1089719
  _Itedlev_2 |  -.2116065   .0397215    -5.33   0.000    -.2894714   -.1337417
_Ixrgrlump_1 |  -.1387575   .0376218    -3.69   0.000    -.2124963   -.0650187
_Ixrgrlump_2 |  -.5036546   .0542983    -9.28   0.000    -.6100818   -.3972274
 _Idepress_1 |  -.0966755   .0401086    -2.41   0.016    -.1752917   -.0180594
 _Ichronic_1 |  -.0482893   .0362095    -1.33   0.182    -.1192825    .0227039
 _Ichronic_2 |  -.0291002   .0714563    -0.41   0.684    -.1691897    .1109893
  _Ispouse_1 |  -.0582984   .0371295    -1.57   0.116    -.1310722    .0144754
  _Ispouse_2 |   .0228096   .0356349     0.64   0.522    -.0470354    .0926545
------------------------------------------------------------------------------

. *model 3:
. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2 
> 4 5 6)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)
i.xdeclatt        _Ixdeclatt_0-2      (naturally coded; _Ixdeclatt_0 omitted)
i.xjobdemt        _Ixjobdemt_0-2      (naturally coded; _Ixjobdemt_0 omitted)
i.support         _Isupport_0-2       (naturally coded; _Isupport_0 omitted)
