-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc/log_hpc.log
  log type:  text
 opened on:  13 Feb 2017, 15:20:29

. 
. use ../imputed.dta, clear

. 
. **************************all reason, FIW, not early, model 1:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender if early==0, compete(exit_t
> ype ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       4411
                                                  Average RVI     =     0.0235
                                                  Largest FMI     =     0.1232
DF adjustment:   Large sample                     DF:     min     =    1608.53
                                                          avg     =   1.51e+08
                                                          max     =   4.71e+08
Model F test:       Equal FMI                     F(   6,257395.4)=      23.86
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |  -.0235671   .0118578    -1.99   0.047    -.0468254   -.0003088
_Ixage_qgp_2 |   .0954557   .0575788     1.66   0.097    -.0173966     .208308
_Ixage_qgp_3 |   .1324189   .0605313     2.19   0.029     .0137797    .2510581
_Ixage_qgp_4 |   .4350741   .0578674     7.52   0.000      .321656    .5484922
_Ixage_qgp_5 |   .4775112   .0867047     5.51   0.000     .3075732    .6474493
  _Igender_1 |   .1897607    .037851     5.01   0.000     .1155742    .2639473
------------------------------------------------------------------------------

. **************************all reason, FIW, not early, model 2:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse if i.early==0, *compete(exit_type ==2)
. ***************************all reason, FIW, early, model 1:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender if early==1, compete(exit_
> type ==2)
. ***************************all reason, FIW, early, model 2:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse if i.early==1, compete(exit_type ==2)
. 
. 
. saveold newresult, replace
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc/log_hpc.log
  log type:  text
 closed on:  13 Feb 2017, 15:42:59
-------------------------------------------------------------------------------
