-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc/log_hpc.log
  log type:  text
 opened on:  29 Jun 2017, 19:05:24

. 
. use ../EWL_mergedfiles_imputed.dta, clear

. 
. gen ageenter=agexp

. mi stset age_exitB,enter(ageenter) failure(fail=1)

     failure event:  fail == 1
obs. time interval:  (0, age_exitB]
 enter on or after:  time ageenter
 exit on or before:  failure

------------------------------------------------------------------------------
       7740  total observations
          0  exclusions
------------------------------------------------------------------------------
       7740  observations remaining, representing
       5755  failures in single-record/single-failure data
  86014.207  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =     39.58
                                          last observed exit t =     81.02

. 
. *model 3
. 
. mi estimate,hr:stcrreg lastftow agexp i.tedlev i.lastgrade i.lastdepress i.la
> stworksp i.lastchronic i.lastjobdemt i.lastdeclatt i.lastjobsupp if sex==1& d
> rop1!=1&drop2!=1&drop3!=1&drop4!=1, compete(exit_typeL==2)
note: option shr is assumed

Multiple-imputation estimates                   Imputations       =         25
Competing-risks regression                      Number of obs     =      5,406
                                                Average RVI       =     0.0359
                                                Largest FMI       =     0.1643
DF adjustment:   Large sample                   DF:     min       =     908.89
                                                        avg       = 1960784.28
                                                        max       =   1.16e+07
Model F test:       Equal FMI                   F(  17,332599.8)  =      20.44
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
          _t |        SHR   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lastftow |    .967257   .0104258    -3.09   0.002     .9470368    .9879091
       agexp |   1.012926   .0032758     3.97   0.000     1.006526    1.019367
             |
      tedlev |
A level o..  |   .9677394   .0416333    -0.76   0.446     .8894671      1.0529
Degree le..  |   .8276356   .0335388    -4.67   0.000     .7644355    .8960609
             |
   lastgrade |
          2  |   1.049992   .0390382     1.31   0.189     .9761992    1.129362
          3  |   .7748353   .0581743    -3.40   0.001     .6688077    .8976718
             |
 lastdepress |
 1 yes, h..  |   1.235511   .0679457     3.85   0.000     1.109264    1.376127
             |
  lastworksp |
          1  |   .8306477   .0396314    -3.89   0.000     .7563986    .9121853
          2  |   .8237173   .0446351    -3.58   0.000     .7406488    .9161024
             |
 lastchronic |
          1  |   .6815789   .0284068    -9.20   0.000     .6281159    .7395924
          2  |   .5492336   .0687904    -4.78   0.000     .4296807    .7020505
             |
 lastjobdemt |
          1  |   1.262792   .0519473     5.67   0.000     1.164973    1.368824
          2  |   1.430701   .0664042     7.72   0.000     1.306295    1.566954
             |
 lastdeclatt |
          1  |   .9952489   .0476993    -0.10   0.921     .9060165     1.09327
          2  |    .737958   .0355589    -6.31   0.000     .6714535    .8110495
             |
 lastjobsupp |
          1  |   1.118276   .0440641     2.84   0.005     1.035163    1.208062
          2  |   1.067151   .0418016     1.66   0.097     .9882875    1.152308
------------------------------------------------------------------------------

. mi estimate,hr:stcrreg lastftow agexp i.tedlev i.lastgrade i.lastdepress i.la
> stworksp i.lastchronic i.lastjobdemt i.lastdeclatt i.lastjobsupp  if sex==2& 
> drop1!=1&drop2!=1&drop3!=1&drop4!=1, compete(exit_typeL==2)
note: option shr is assumed

Multiple-imputation estimates                   Imputations       =         25
Competing-risks regression                      Number of obs     =      2,334
                                                Average RVI       =     0.0458
                                                Largest FMI       =     0.1880
DF adjustment:   Large sample                   DF:     min       =     696.05
                                                        avg       = 3016689.69
                                                        max       =   2.11e+07
Model F test:       Equal FMI                   F(  17,209107.1)  =       8.70
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
          _t |        SHR   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lastftow |    1.04149   .0159088     2.66   0.008     1.010768    1.073147
       agexp |   1.014261   .0047985     2.99   0.003     1.004899    1.023709
             |
      tedlev |
A level o..  |   1.085153   .0711837     1.25   0.213     .9542098    1.234065
Degree le..  |   .8284855   .0589094    -2.65   0.008     .7206746    .9524245
             |
   lastgrade |
          2  |    1.18777   .0887993     2.30   0.021     1.025871    1.375218
          3  |   1.154232   .0981082     1.69   0.092     .9770994    1.363476
             |
 lastdepress |
 1 yes, h..  |   1.088538   .0743277     1.24   0.214     .9521611    1.244449
             |
  lastworksp |
          1  |   .9679918   .0506134    -0.62   0.534     .8735492    1.072645
          2  |   .8909949   .1113333    -0.92   0.356     .6972157    1.138632
             |
 lastchronic |
          1  |   .6284738   .0413784    -7.05   0.000     .5523883    .7150393
          2  |   .5322204   .0847167    -3.96   0.000     .3895835    .7270805
             |
 lastjobdemt |
          1  |   1.138962   .0621028     2.39   0.017     1.023521    1.267423
          2  |   1.326103   .0867251     4.32   0.000     1.166568    1.507456
             |
 lastdeclatt |
          1  |   1.033862   .0552853     0.62   0.533       .93099    1.148102
          2  |   .8799663   .0605445    -1.86   0.063     .7689539    1.007005
             |
 lastjobsupp |
          1  |   1.087381   .0614986     1.48   0.139     .9732867    1.214851
          2  |   1.004134   .0581444     0.07   0.943     .8964015    1.124813
------------------------------------------------------------------------------

. mi estimate,hr:stcrreg lastwtof agexp i.tedlev i.lastgrade i.lastdepress i.la
> stworksp i.lastchronic i.lastjobdemt i.lastdeclatt i.lastjobsupp  if sex==1& 
> drop1!=1&drop2!=1&drop3!=1&drop4!=1, compete(exit_typeL==2)
note: option shr is assumed

Multiple-imputation estimates                   Imputations       =         25
Competing-risks regression                      Number of obs     =      5,406
                                                Average RVI       =     0.0378
                                                Largest FMI       =     0.1682
DF adjustment:   Large sample                   DF:     min       =     868.36
                                                        avg       = 1372071.52
                                                        max       =   1.08e+07
Model F test:       Equal FMI                   F(  17,302066.9)  =      19.61
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
          _t |        SHR   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lastwtof |   1.008557    .010431     0.82   0.410      .988316    1.029212
       agexp |   1.013619   .0032854     4.17   0.000       1.0072    1.020078
             |
      tedlev |
A level o..  |   .9585603   .0412676    -0.98   0.326     .8809785    1.042974
Degree le..  |   .8238186   .0333233    -4.79   0.000     .7610199    .8917994
             |
   lastgrade |
          2  |   1.057185   .0396945     1.48   0.139      .982179     1.13792
          3  |   .7892967   .0595312    -3.14   0.002     .6808316    .9150416
             |
 lastdepress |
 1 yes, h..  |   1.206305   .0658564     3.44   0.001     1.083892    1.342543
             |
  lastworksp |
          1  |   .8219566   .0395684    -4.07   0.000     .7478518    .9034046
          2  |   .8084903   .0440215    -3.90   0.000      .726581    .8996333
             |
 lastchronic |
          1  |   .6796225     .02828    -9.28   0.000     .6263947    .7373733
          2  |   .5407636    .067664    -4.91   0.000     .4231549    .6910596
             |
 lastjobdemt |
          1  |   1.236188   .0515707     5.08   0.000     1.139133    1.341512
          2  |   1.377988   .0678045     6.52   0.000       1.2513    1.517502
             |
 lastdeclatt |
          1  |   .9955618   .0478789    -0.09   0.926     .9060078    1.093968
          2  |   .7417988   .0358854    -6.17   0.000     .6746959    .8155755
             |
 lastjobsupp |
          1  |   1.126083   .0445481     3.00   0.003     1.042069     1.21687
          2  |   1.083925    .042805     2.04   0.041     1.003193    1.171154
------------------------------------------------------------------------------

. mi estimate,hr:stcrreg lastwtof agexp i.tedlev i.lastgrade i.lastdepress i.la
> stworksp i.lastchronic i.lastjobdemt i.lastdeclatt i.lastjobsupp  if sex==2& 
> drop1!=1&drop2!=1&drop3!=1&drop4!=1, compete(exit_typeL==2)
note: option shr is assumed

Multiple-imputation estimates                   Imputations       =         25
Competing-risks regression                      Number of obs     =      2,334
                                                Average RVI       =     0.0474
                                                Largest FMI       =     0.1787
DF adjustment:   Large sample                   DF:     min       =     770.15
                                                        avg       = 905,448.13
                                                        max       = 4616144.33
Model F test:       Equal FMI                   F(  17,195574.0)  =       8.99
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
          _t |        SHR   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lastwtof |   1.060849   .0177951     3.52   0.000     1.026527    1.096318
       agexp |   1.015199    .004791     3.20   0.001     1.005852    1.024633
             |
      tedlev |
A level o..  |    1.07672    .070994     1.12   0.262     .9461687    1.225285
Degree le..  |   .8306638   .0588792    -2.62   0.009     .7228844    .9545126
             |
   lastgrade |
          2  |   1.234651   .0932354     2.79   0.005     1.064786    1.431615
          3  |   1.218561   .1057875     2.28   0.023     1.027891      1.4446
             |
 lastdepress |
 1 yes, h..  |   1.084156   .0735033     1.19   0.233     .9492336    1.238256
             |
  lastworksp |
          1  |   .9570039   .0496378    -0.85   0.397     .8643591    1.059579
          2  |   .8881277   .1112152    -0.95   0.344     .6945833    1.135603
             |
 lastchronic |
          1  |   .6358459   .0421014    -6.84   0.000     .5584586    .7239569
          2  |   .5240462   .0838352    -4.04   0.000     .3829986    .7170379
             |
 lastjobdemt |
          1  |    1.11381   .0612942     1.96   0.050     .9999271    1.240663
          2  |   1.236427   .0862149     3.04   0.002     1.078486    1.417499
             |
 lastdeclatt |
          1  |   1.037675   .0556956     0.69   0.491     .9340587    1.152785
          2  |    .874373   .0600642    -1.95   0.051     .7642295    1.000391
             |
 lastjobsupp |
          1  |   1.100008   .0622921     1.68   0.092     .9844489    1.229131
          2  |   1.023719   .0601056     0.40   0.690     .9124393     1.14857
------------------------------------------------------------------------------

. 
. 
. saveold newresult, replace
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc/log_hpc.log
  log type:  text
 closed on:  29 Jun 2017, 22:00:33
-------------------------------------------------------------------------------
