
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501306262937
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do hpc6.do 

. cd ~/git/baowen/hpc6
/gpfs/home/fas/meghir/rg684/git/baowen/hpc6

. set more 1

. cap log close

. log using log_hpc6, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc6/log_hpc6.log
  log type:  text
 opened on:   6 Apr 2017, 18:34:29

. 
. use ../imputed_march.dta, clear

. 
. 
. mi stset time2, id(id) failure(exit_typeLvar==5) exit(allexit==1)

                id:  idout_107
     failure event:  exit_typeLvar == 5
obs. time interval:  (time2[_n-1], time2]
 exit on or before:  allexit==1

------------------------------------------------------------------------------
    68384  total observations
    21053  observations begin on or after exit
------------------------------------------------------------------------------
    47331  observations remaining, representing
     8548  subjects
      593  failures in single-failure-per-subject data
 111649.5  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =         0
                                        last observed exit t =     23.09

. 
. *model 4
. *mi estimate,hr:stcrreg lastftow ageenter i.education i.lastgrade i.lastdepre
> ss i.lastwsp i.chronic i.lastjobdemt i.lastdeclatt i.lastsupp i.lastcarer i.l
> astnumchild i.biconhm if gender==0&notuse!=1, compete(exit_typeLvar ==2 3 4 6
> )
. mi estimate,hr:stcrreg lastftow ageenter i.education i.lastgrade i.lastdepres
> s i.lastwsp i.chronic i.lastjobdemt i.lastdeclatt i.lastsupp i.lastcarer i.la
> stnumchild i.biconhm if gender==1&notuse!=1, compete(exit_typeLvar ==2 3 4 6)
note: option shr is assumed

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =      12146
                                                  Average RVI     =     0.0425
                                                  Largest FMI     =     0.2211
DF adjustment:   Large sample                     DF:     min     =     504.85
                                                          avg     = 4488929.31
                                                          max     =   4.09e+07
Model F test:       Equal FMI                     F(  23,326888.8)=      10.99
Within VCE type:       Robust                     Prob > F        =     0.0000

                          (Within VCE adjusted for 2334 clusters in idout_107)
------------------------------------------------------------------------------
          _t |        SHR   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lastftow |   1.035978   .0540199     0.68   0.498     .9353151    1.147476
    ageenter |   .9847244   .0122593    -1.24   0.216     .9609873    1.009048
             |
   education |
          2  |   .9083778   .1898326    -0.46   0.646     .6030154    1.368373
          3  |   .8731523   .1845349    -0.64   0.521     .5770054    1.321296
             |
   lastgrade |
          2  |   1.092025   .2773858     0.35   0.729     .6637712    1.796581
          3  |   1.282916   .3829664     0.83   0.404     .7146667    2.302993
             |
 lastdepress |
 1 yes, h..  |   1.544805   .3148384     2.13   0.033     1.036035    2.303418
             |
     lastwsp |
 1 not wo..  |   1.093241   .2770585     0.35   0.725     .6644747    1.798676
    2 no sp  |   1.147384   .2064475     0.76   0.445     .8062845    1.632787
             |
     chronic |
          1  |   2.071749   .3774555     4.00   0.000     1.449623    2.960867
          2  |   3.383861   1.270874     3.25   0.001     1.620792    7.064765
          3  |   7.32e-07   7.76e-07   -13.33   0.000     9.17e-08    5.85e-06
             |
 lastjobdemt |
          1  |   1.030639   .1915834     0.16   0.871     .7159428    1.483661
          2  |    1.14625   .2459647     0.64   0.525     .7527086    1.745549
             |
 lastdeclatt |
          1  |   .7091789   .1289415    -1.89   0.059     .4965827    1.012792
          2  |   .5328824   .1236002    -2.71   0.007     .3382177    .8395882
             |
    lastsupp |
          1  |   .8949025   .1611494    -0.62   0.537     .6287758    1.273666
          2  |   .8699676   .1689499    -0.72   0.473     .5945625    1.272942
             |
 1.lastcarer |    1.15436   .2374124     0.70   0.485     .7713959    1.727447
             |
lastnumchild |
          1  |   1.130189   .2260534     0.61   0.541     .7635953    1.672781
          2  |   .8948037   .1933685    -0.51   0.607     .5857674     1.36688
          3  |   1.454372   .5182784     1.05   0.293     .7232965    2.924387
             |
     biconhm |
1 have co..  |   1.203641   .3083731     0.72   0.469     .7283339    1.989133
------------------------------------------------------------------------------

. *mi estimate,hr:stcrreg lastwtof ageenter i.education i.lastgrade i.lastdepre
> ss i.lastwsp i.chronic i.lastjobdemt i.lastdeclatt i.lastsupp i.lastcarer i.l
> astnumchild i.biconhm if gender==0&notuse!=1, compete(exit_typeLvar ==2 3 4 6
> )
. *mi estimate,hr:stcrreg lastwtof ageenter i.education i.lastgrade i.lastdepre
> ss i.lastwsp i.chronic i.lastjobdemt i.lastdeclatt i.lastsupp i.lastcarer i.l
> astnumchild i.biconhm if gender==1&notuse!=1, compete(exit_typeLvar ==2 3 4 6
> )
. 
. 
. 
. 
. saveold newresult, replace
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc6/log_hpc6.log
  log type:  text
 closed on:   6 Apr 2017, 20:47:43
-------------------------------------------------------------------------------

. 
end of do-file
