
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501306262937
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do hpc5.do 

. cd ~/git/baowen/hpc5
/gpfs/home/fas/meghir/rg684/git/baowen/hpc5

. set more 1

. cap log close

. log using log_hpc5, text replace
(note: file /gpfs/home/fas/meghir/rg684/git/baowen/hpc5/log_hpc5.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc5/log_hpc5.log
  log type:  text
 opened on:   9 Feb 2017, 09:20:00

. 
. use ../imputed.dta, clear

. 
. ******************retire>60, FIW
. mi stset age_exitnew, failure(retiretime==2) enter(xage_q)exit (age_exitnew=7
> 5)

     failure event:  retiretime == 2
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     3372  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(retiretime==1 3)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       7913
                                                  Average RVI     =     0.0237
                                                  Largest FMI     =     0.1252
DF adjustment:   Large sample                     DF:     min     =    1559.30
                                                          avg     =   1.53e+10
                                                          max     =   8.25e+10
Model F test:       Equal FMI                     F(   6,254531.8)=     177.78
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0066156   .0112216     0.59   0.556    -.0153955    .0286266
_Ixage_qgp_2 |   .5010794   .0586698     8.54   0.000     .3860888      .61607
_Ixage_qgp_3 |   .6097331    .059765    10.20   0.000     .4925959    .7268703
_Ixage_qgp_4 |   1.323572   .0562387    23.53   0.000     1.213347    1.433798
_Ixage_qgp_5 |   1.888446   .0747448    25.27   0.000     1.741949    2.034943
  _Igender_1 |   .0476253    .035613     1.34   0.181    -.0221748    .1174254
------------------------------------------------------------------------------

. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse, compete(retiretime==1 3)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)
