
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501306262937
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do hpc5.do 

. cd ~/git/baowen/hpc5
/gpfs/home/fas/meghir/rg684/git/baowen/hpc5

. set more 1

. cap log close

. log using log_hpc5, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc5/log_hpc5.log
  log type:  text
 opened on:   7 Feb 2017, 00:12:09

. 
. use ../imputed.dta, clear

. 
. ***************retired
. *mi stset age_exitnew, failure(exit_type==3) enter(xage_q)exit (age_exitnew=7
> 5)
. *model 1:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 4 5
>  6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 4 5
>  6)
. *mode1 2:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse , compete(exit_type ==2 4 5 6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse, compete(exit_type ==2 4 5 6)
. *model 3:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  4 5 6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  4 5 6)
. 
. ***************unemployed
. mi stset age_exitnew, failure(exit_type==4) enter(xage_q)exit (age_exitnew=75
> )

     failure event:  exit_type == 4
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
      435  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. *model 1:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 3 5
>  6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 3 5
>  6)
. 
. *mode1 2:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse , compete(exit_type ==2 3 5 6)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse, compete(exit_type ==2 3 5 6)
. *model 3:
. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2 
> 3 5 6)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)
i.xdeclatt        _Ixdeclatt_0-2      (naturally coded; _Ixdeclatt_0 omitted)
i.xjobdemt        _Ixjobdemt_0-2      (naturally coded; _Ixjobdemt_0 omitted)
i.support         _Isupport_0-2       (naturally coded; _Isupport_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       7913
                                                  Average RVI     =     0.0628
                                                  Largest FMI     =     0.2200
DF adjustment:   Large sample                     DF:     min     =     509.89
                                                          avg     = 2164531.13
                                                          max     =   1.92e+07
Model F test:       Equal FMI                     F(  21,142301.2)=       6.13
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0339072   .0337297     1.01   0.315    -.0323592    .1001735
_Ixage_qgp_2 |   .1496139   .1328333     1.13   0.260    -.1107346    .4099624
_Ixage_qgp_3 |   .8627957   .1567617     5.50   0.000     .5555484    1.170043
_Ixage_qgp_4 |   .8665129   .2026545     4.28   0.000     .4693173    1.263709
_Ixage_qgp_5 |   1.161989   .4736947     2.45   0.014     .2335643    2.090414
  _Igender_1 |  -.4090611     .11916    -3.43   0.001    -.6426105   -.1755118
  _Itedlev_1 |  -.4379014   .1365626    -3.21   0.001    -.7055855   -.1702173
  _Itedlev_2 |  -.1464978   .1285791    -1.14   0.255    -.3985191    .1055235
_Ixrgrlump_1 |   .3727225   .1319297     2.83   0.005     .1141402    .6313049
_Ixrgrlump_2 |   .4622456    .196721     2.35   0.019     .0766587    .8478324
 _Idepress_1 |   .0548959   .1252911     0.44   0.661    -.1907305    .3005223
 _Ichronic_1 |   .0471761   .1174493     0.40   0.688    -.1830514    .2774037
 _Ichronic_2 |    .128339   .2307605     0.56   0.578    -.3241782    .5808563
  _Ispouse_1 |  -.2812423   .1399523    -2.01   0.045    -.5555733   -.0069112
  _Ispouse_2 |   .1822882   .1116169     1.63   0.102    -.0364989    .4010753
_Ixdeclatt_1 |  -.0577193   .1425914    -0.40   0.686    -.3373577     .221919
_Ixdeclatt_2 |  -.0156121   .1502784    -0.10   0.917    -.3102894    .2790652
_Ixjobdemt_1 |  -.1152347    .129985    -0.89   0.375    -.3700713     .139602
_Ixjobdemt_2 |  -.2405554   .1487347    -1.62   0.106     -.532151    .0510403
 _Isupport_1 |  -.4557741   .1279305    -3.56   0.000    -.7066045   -.2049437
 _Isupport_2 |  -.5257843   .1296897    -4.05   0.000    -.7801458   -.2714227
------------------------------------------------------------------------------

. xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2 
> 3 5 6)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)
i.xdeclatt        _Ixdeclatt_0-2      (naturally coded; _Ixdeclatt_0 omitted)
i.xjobdemt        _Ixjobdemt_0-2      (naturally coded; _Ixjobdemt_0 omitted)
i.support         _Isupport_0-2       (naturally coded; _Isupport_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       7913
                                                  Average RVI     =     0.0628
                                                  Largest FMI     =     0.2143
DF adjustment:   Large sample                     DF:     min     =     537.07
                                                          avg     = 2230373.30
                                                          max     =   1.80e+07
Model F test:       Equal FMI                     F(  21,142274.8)=       6.04
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        wtof |   .0133983     .03526     0.38   0.704     -.055866    .0826627
_Ixage_qgp_2 |   .1500395   .1329311     1.13   0.259    -.1105008    .4105797
_Ixage_qgp_3 |   .8567161   .1562544     5.48   0.000      .550463    1.162969
_Ixage_qgp_4 |   .8582191   .2023325     4.24   0.000     .4616546    1.254784
_Ixage_qgp_5 |   1.156195   .4739342     2.44   0.015     .2273009    2.085089
  _Igender_1 |  -.4005247   .1193982    -3.35   0.001     -.634541   -.1665084
  _Itedlev_1 |  -.4369236   .1366415    -3.20   0.001    -.7047623    -.169085
  _Itedlev_2 |  -.1438427    .128492    -1.12   0.263    -.3956932    .1080077
_Ixrgrlump_1 |   .3822023   .1343393     2.85   0.004     .1188928    .6455117
_Ixrgrlump_2 |   .4753052   .2002764     2.37   0.018     .0827367    .8678738
 _Idepress_1 |   .0705684   .1231729     0.57   0.567    -.1708819    .3120187
 _Ichronic_1 |   .0461141   .1174865     0.39   0.695    -.1841866    .2764148
 _Ichronic_2 |   .1308606   .2313646     0.57   0.572    -.3228593    .5845805
  _Ispouse_1 |  -.2797112   .1402592    -1.99   0.046    -.5546448   -.0047776
  _Ispouse_2 |   .1704423   .1115184     1.53   0.126    -.0481461    .3890307
_Ixdeclatt_1 |  -.0574783   .1428266    -0.40   0.687    -.3375809    .2226242
_Ixdeclatt_2 |  -.0216258   .1509985    -0.14   0.886    -.3177202    .2744685
_Ixjobdemt_1 |  -.1114192    .131322    -0.85   0.396    -.3688616    .1460231
_Ixjobdemt_2 |  -.2399138   .1520054    -1.58   0.115    -.5379335    .0581059
 _Isupport_1 |  -.4548143   .1284108    -3.54   0.000    -.7065958   -.2030328
 _Isupport_2 |  -.5262042   .1305797    -4.03   0.000    -.7823135    -.270095
------------------------------------------------------------------------------

. /*
> ***************health reason
> mi stset age_exitnew, failure(exit_type==5) enter(xage_q)exit (age_exitnew=75
> )
> *model 1:
> xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 3 4 
> 6)
> xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 3 4 
> 6)
> *mode1 2:
> xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse , compete(exit_type ==2 3 4 6)
> xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse, compete(exit_type ==2 3 4 6)
> *model 3:
> xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2 
> 3 4 6)
> xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2 
> 3 4 6)
> */
. 
. ***************other
. *mi stset age_exitnew, failure(exit_type==6) enter(xage_q)exit (age_exitnew=7
> 5)
. *model 1:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(exit_type ==2 3 4
>  5)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender, compete(exit_type ==2 3 4
>  5)
. *mode1 2:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse , compete(exit_type ==2 3 4 5)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse, compete(exit_type ==2 3 4 5)
. *model 3:
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  3 4 5)
. *xi: mi estimate: stcrreg wtof i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse i.xdeclatt i.xjobdemt i.support, compete(exit_type ==2
>  3 4 5)
. 
. 
. saveold newresult, replace
(note: file newresult.dta not found)
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc5/log_hpc5.log
  log type:  text
 closed on:   7 Feb 2017, 10:15:27
-------------------------------------------------------------------------------

. 
end of do-file
