
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501306262937
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do hpc5.do

. cd ~/git/baowen/hpc5
/gpfs/home/fas/meghir/rg684/git/baowen/hpc5

. set more 1

. cap log close

. log using log_hpc5, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc5/log_hpc5.log
  log type:  text
 opened on:  10 Feb 2017, 10:00:49

.
. use ../imputed.dta, clear

.
. ******************retire>60, FIW
. mi stset age_exitnew, failure(retiretime==2) enter(xage_q)exit (age_exitnew=7
> 5)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)

     failure event:  retiretime == 2
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     3372  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender, compete(retiretime==1 3)
. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse, compete(retiretime==1 3)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       7913
                                                  Average RVI     =     0.0413
                                                  Largest FMI     =     0.1345
DF adjustment:   Large sample                     DF:     min     =    1352.59
                                                          avg     =   1.05e+07
                                                          max     =   1.33e+08
Model F test:       Equal FMI                     F(  15,223615.8)=      74.13
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0036247   .0116171     0.31   0.755    -.0191648    .0264143
_Ixage_qgp_2 |   .5098923   .0588621     8.66   0.000     .3945247      .62526
_Ixage_qgp_3 |   .6257572   .0602661    10.38   0.000     .5076378    .7438766
_Ixage_qgp_4 |   1.325144   .0578105    22.92   0.000     1.211837     1.43845
_Ixage_qgp_5 |   1.883893   .0773094    24.37   0.000     1.732369    2.035416
  _Igender_1 |   .0039598   .0402284     0.10   0.922    -.0748866    .0828062
  _Itedlev_1 |  -.1112198    .047239    -2.35   0.019    -.2038204   -.0186192
  _Itedlev_2 |   .0395469   .0444862     0.89   0.374    -.0476548    .1267486
_Ixrgrlump_1 |   .1476629   .0414853     3.56   0.000      .066353    .2289729
_Ixrgrlump_2 |   .2188283   .0546063     4.01   0.000     .1118015    .3258552
 _Idepress_1 |  -.0212443   .0451999    -0.47   0.638    -.1098468    .0673582
 _Ichronic_1 |  -.0648669   .0415456    -1.56   0.119    -.1463473    .0166134
 _Ichronic_2 |  -.0386194   .0752985    -0.51   0.608    -.1862942    .1090553
  _Ispouse_1 |   .0899175   .0432591     2.08   0.038     .0051257    .1747092
  _Ispouse_2 |  -.1051495   .0404716    -2.60   0.009    -.1844761   -.0258229
------------------------------------------------------------------------------

.
. saveold newresult, replace
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc5/log_hpc5.log
  log type:  text
 closed on:  11 Feb 2017, 18:19:43
-------------------------------------------------------------------------------

.
end of do-file
