
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

7-user 8-core Stata network perpetual license:
       Serial number:  501306262937
         Licensed to:  Yale University
                       New Haven, CT

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

Note:  Your site can add messages to the introduction by editing the file
       stata.msg in the directory where Stata is installed.

. do hpc4.do 

. cd ~/git/baowen/hpc4
/gpfs/home/fas/meghir/rg684/git/baowen/hpc4

. set more 1

. cap log close

. log using log_hpc4, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc4/log_hpc4.log
  log type:  text
 opened on:  13 Feb 2017, 15:23:04

. 
. use ../imputed.dta, clear

. 
. **************************all reason, FIW, not early, model 1:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender if early==0, compete(exit_
> type ==2)
. ***************************all reason, FIW, not early, model 2:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse if i.early==0, *compete(exit_type ==2)
. ***************************all reason, FIW, early, model 1:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender if early==1, compete(exit_
> type ==2)
. **************************all reason, FIW, early, model 2:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse if early==1, compete(exit_type ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       3502
                                                  Average RVI     =     0.0392
                                                  Largest FMI     =     0.1136
DF adjustment:   Large sample                     DF:     min     =    1890.67
                                                          avg     =  514721.71
                                                          max     = 4204535.51
Model F test:       Equal FMI                     F(  14,230656.4)=       8.25
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0192938   .0127808     1.51   0.131    -.0057723    .0443598
_Ixage_qgp_2 |   .2344175    .046652     5.02   0.000     .1429812    .3258539
_Ixage_qgp_3 |   .3157147   .0538246     5.87   0.000     .2102204     .421209
_Ixage_qgp_4 |   .2065381   .0652226     3.17   0.002     .0787039    .3343724
_Ixage_qgp_5 |          0  (omitted)
  _Igender_1 |   .1396507   .0459069     3.04   0.002     .0496747    .2296267
  _Itedlev_1 |  -.0215302   .0494087    -0.44   0.663    -.1183887    .0753283
  _Itedlev_2 |   -.141266   .0521793    -2.71   0.007    -.2435636   -.0389683
_Ixrgrlump_1 |  -.0147547   .0438361    -0.34   0.736    -.1006724     .071163
_Ixrgrlump_2 |  -.3032717   .0765055    -3.96   0.000    -.4532205   -.1533229
 _Idepress_1 |   .0964781   .0496506     1.94   0.052    -.0008413    .1937975
 _Ichronic_1 |  -.0353625   .0476061    -0.74   0.458    -.1287124    .0579874
 _Ichronic_2 |   .0357055   .0981875     0.36   0.716    -.1567903    .2282012
  _Ispouse_1 |   .0715769   .0495254     1.45   0.148    -.0254941    .1686479
  _Ispouse_2 |   .2357407   .0457327     5.15   0.000      .146097    .3253843
------------------------------------------------------------------------------

. 
. saveold newresult, replace
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc4/log_hpc4.log
  log type:  text
 closed on:  13 Feb 2017, 15:53:42
-------------------------------------------------------------------------------

. 
end of do-file
