
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.1   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

5-user 4-core Stata network perpetual license:
       Serial number:  501406219442
         Licensed to:  Department of Economics
                       University College London

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do hpc4.do 

. cd ~/git/baowen/hpc4
/data/uctprgu/git/baowen/hpc4

. set more 1

. cap log close

. log using log_hpc4, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /data/uctprgu/git/baowen/hpc4/log_hpc4.log
  log type:  text
 opened on:   3 Jan 2016, 13:56:18

. 
. use ../statacomplete, clear
(Written by R.              )

. 
. xi:mim,cat(fit):gllamm alcogrp part1 part2 fat energy gender lastbmi retireag
> e i.provinces i.spstatus i.lastsmoking i.education i.skills lastincome index 
> ///
> age1991 i.lastactivity if yearcenter<=17& yearcenter>=-17&w2>1993, i(idind ne
> whhid) link(mlogit) family(binom) 
i.provinces       _Iprovinces_0-8     (naturally coded; _Iprovinces_0 omitted)
i.spstatus        _Ispstatus_0-2      (naturally coded; _Ispstatus_0 omitted)
i.lastsmoking     _Ilastsmoki_1-3     (naturally coded; _Ilastsmoki_1 omitted)
i.education       _Ieducation_0-5     (naturally coded; _Ieducation_0 omitted)
i.skills          _Iskills_0-3        (naturally coded; _Iskills_0 omitted)
i.lastactivity    _Ilastactiv_0-3     (naturally coded; _Ilastactiv_0 omitted)
[note: using mi-style format variables _mi_id and _mi_m]

Multiple-imputation estimates (gllamm)                   Imputations =      25
gllamm model                                             Minimum obs =    3844
                                                         Minimum dof =   190.0

------------------------------------------------------------------------------
     alcogrp |     Coef.  Std. Err.     t    P>|t|    [95% Conf. Int.]     FMI
-------------+----------------------------------------------------------------
c1           |
       part1 |  -.091211   .017698   -5.15   0.000   -.125902 -.056519   0.038
       part2 |   .047007   .030557    1.54   0.124   -.012889  .106903   0.036
         fat |  -.004835    .00225   -2.15   0.032   -.009255 -.000416   0.183
      energy |   .000429   .000135    3.17   0.002    .000164  .000693   0.103
      gender |  -3.30406   .277338  -11.91   0.000   -3.84775 -2.76038   0.055
     lastbmi |   .027854   .032931    0.85   0.398   -.036697  .092404   0.038
   retireage |  -.057762   .031945   -1.81   0.071   -.120377  .004852   0.027
_Iprovince~1 |  -.050462   .408449   -0.12   0.902   -.851042  .750118   0.025
_Iprovince~2 |  -.322654    .36618   -0.88   0.378   -1.04037  .395059   0.016
_Iprovince~3 |   .631335    .36866    1.71   0.087   -.091256  1.35393   0.024
_Iprovince~4 |   .452392   .449087    1.01   0.314   -.427877  1.33266   0.034
_Iprovince~5 |  -.170707   .422147   -0.40   0.686    -.99816  .656746   0.032
_Iprovince~6 |  -1.37641   .396459   -3.47   0.001   -2.15347 -.599355   0.016
_Iprovince~7 |  -.465173   .430668   -1.08   0.280   -1.30936  .379011   0.039
_Iprovince~8 |  -.835802   .435829   -1.92   0.055   -1.69002  .018415   0.011
_Ispstatus_1 |   .144077   .216535    0.67   0.506   -.280369  .568522   0.038
_Ispstatus_2 |   .028427   .389231    0.07   0.942   -.734461  .791315   0.013
_Ilastsmok~2 |   .967346   .239334    4.04   0.000    .498219  1.43647   0.035
_Ilastsmok~3 |   .358728   .439522    0.82   0.414   -.502967  1.22042   0.064
_Ieducatio~1 |  -.007052   .397879   -0.02   0.986   -.786903    .7728   0.020
_Ieducatio~2 |   .099171   .383663    0.26   0.796   -.652811  .851154   0.017
_Ieducatio~3 |   .299513   .412211    0.73   0.467   -.508433  1.10746   0.021
_Ieducatio~4 |   .490821   .443096    1.11   0.268   -.377663  1.35931   0.023
_Ieducatio~5 |    .30667   .475413    0.65   0.519    -.62516   1.2385   0.024
  _Iskills_1 |  -.092874   .402672   -0.23   0.818   -.882157  .696408   0.033
  _Iskills_2 |  -.281252   .430326   -0.65   0.513   -1.12475  .562243   0.034
  _Iskills_3 |  -.014215   .448377   -0.03   0.975    -.89308   .86465   0.031
  lastincome |   .122921   .075765    1.62   0.105   -.025622  .271464   0.066
       index |   .000793   .006285    0.13   0.900   -.011527  .013112   0.047
     age1991 |     .0307   .027738    1.11   0.268   -.023669  .085069   0.028
_Ilastacti~1 |   -.17249   .237346   -0.73   0.467   -.637818  .292837   0.065
_Ilastacti~2 |   .326575   .304533    1.07   0.284   -.270554  .923704   0.078
_Ilastacti~3 |  -.107272   .391884   -0.27   0.784   -.875686  .661143   0.079
       _cons |   .996265   1.70067    0.59   0.558   -2.33713  4.32966   0.024
-------------+----------------------------------------------------------------
c2           |
       part1 |  -.038308   .022443   -1.71   0.088   -.082329  .005714   0.106
       part2 |  -.076768    .04108   -1.87   0.062   -.157325  .003788   0.086
         fat |   -.00456   .002962   -1.54   0.125   -.010403  .001282   0.316
      energy |   .000575   .000165    3.49   0.001    .000252  .000898   0.150
      gender |  -3.63965   .336425  -10.82   0.000   -4.29926 -2.98003   0.071
     lastbmi |   .047514   .037402    1.27   0.204    -.02584  .120869   0.097
   retireage |  -.075606   .035167   -2.15   0.032   -.144537 -.006675   0.029
_Iprovince~1 |  -.284896   .445428   -0.64   0.522   -1.15797  .588182   0.030
_Iprovince~2 |  -.833836   .399756   -2.09   0.037   -1.61738 -.050288   0.027
_Iprovince~3 |   .165612   .397353    0.42   0.677   -.613222  .944446   0.026
_Iprovince~4 |  -.610018    .55314   -1.10   0.270   -1.69549  .475457   0.135
_Iprovince~5 |  -.646621   .456047   -1.42   0.156   -1.54053  .247289   0.034
_Iprovince~6 |  -1.46284   .426265   -3.43   0.001   -2.29834 -.627337   0.024
_Iprovince~7 |  -.873548    .47671   -1.83   0.067    -1.8081  .061006   0.058
_Iprovince~8 |  -1.86842     .4975   -3.76   0.000   -2.84356 -.893279   0.030
_Ispstatus_1 |  -.178347   .238498   -0.75   0.455   -.645908  .289215   0.059
_Ispstatus_2 |   .283669    .41918    0.68   0.499   -.537916  1.10525   0.011
_Ilastsmok~2 |   1.46857   .260329    5.64   0.000    .958249  1.97889   0.049
_Ilastsmok~3 |   .443017   .480991    0.92   0.357   -.499894  1.38593   0.053
_Ieducatio~1 |  -.220297    .43313   -0.51   0.611   -1.06925   .62866   0.025
_Ieducatio~2 |   .083037   .416286    0.20   0.842   -.732886  .898961   0.018
_Ieducatio~3 |   .387252    .44604    0.87   0.385   -.486994   1.2615   0.020
_Ieducatio~4 |  -.166506   .496625   -0.34   0.737   -1.13997   .80696   0.038
_Ieducatio~5 |   -.17575   .523064   -0.34   0.737   -1.20098  .849476   0.023
  _Iskills_1 |  -.372695   .436768   -0.85   0.394    -1.2291   .48371   0.077
  _Iskills_2 |  -.458086   .470138   -0.97   0.330   -1.38002  .463849   0.087
  _Iskills_3 |    -.0319   .491162   -0.06   0.948   -.995036  .931235   0.084
  lastincome |   .110728   .084287    1.31   0.189   -.054558  .276014   0.087
       index |  -.011352   .007093   -1.60   0.110   -.025263  .002559   0.092
     age1991 |   .036641   .030714    1.19   0.233   -.023561  .096843   0.033
_Ilastacti~1 |  -.198923    .26733   -0.74   0.457   -.723092  .325246   0.076
_Ilastacti~2 |  -.075122   .362886   -0.21   0.836   -.788047  .637804   0.188
_Ilastacti~3 |    .18183   .425929    0.43   0.670   -.653868  1.01753   0.125
       _cons |   .945495   1.91991    0.49   0.622   -2.81887  4.70986   0.073
-------------+----------------------------------------------------------------
idin1        |
       _cons |   1.33925   .222511    6.02   0.000    .903097   1.7754   0.036
-------------+----------------------------------------------------------------
newh2        |
       _cons |   1.26537   .238438    5.31   0.000    .797988  1.73275   0.039
------------------------------------------------------------------------------


. 
. saveold newresult, replace
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
(note: file newresult.dta not found)
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /data/uctprgu/git/baowen/hpc4/log_hpc4.log
  log type:  text
 closed on:   9 Jan 2016, 06:52:30
-------------------------------------------------------------------------------

. 
end of do-file
