-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc4/log_hpc4.log
  log type:  text
 opened on:  20 Feb 2017, 08:51:07

. 
. use ../imputed.dta, clear

. 
. 
. ***************all reason, WIF, men, model 1:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp if gender==0, compete(exit_type ==2
> )
. 
. ***************all reason, WIF, men, model 2:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depr
> ess i.chronic i.spouse if gender==0, compete(exit_type ==2)
. 
. 
. ***************all reason, WIF, women, model 1:
. *mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)
. *xi: mi estimate: stcrreg ftow i.xage_qgp if gender==1, compete(exit_type ==2
> )
. 
. ***************all reason, WIF, women, model 2:
. mi stset age_exitnew, failure(outwork==1) enter(xage_q)exit (age_exitnew=75)

     failure event:  outwork == 1
obs. time interval:  (0, age_exitnew]
 enter on or after:  time xage_q
 exit on or before:  age_exitnew==75

------------------------------------------------------------------------------
     7913  total observations
        0  exclusions
------------------------------------------------------------------------------
     7913  observations remaining, representing
     6126  failures in single-record/single-failure data
 76667.65  total analysis time at risk and under observation
                                              at risk from t =         0
                                   earliest observed entry t =     39.58
                                        last observed exit t =     81.02

. xi: mi estimate: stcrreg ftow i.xage_qgp i.gender i.tedlev i.xrgrlump i.depre
> ss i.chronic i.spouse if gender==1, compete(exit_type ==2)
i.xage_qgp        _Ixage_qgp_1-5      (naturally coded; _Ixage_qgp_1 omitted)
i.gender          _Igender_0-1        (naturally coded; _Igender_0 omitted)
i.tedlev          _Itedlev_0-2        (naturally coded; _Itedlev_0 omitted)
i.xrgrlump        _Ixrgrlump_0-2      (naturally coded; _Ixrgrlump_0 omitted)
i.depress         _Idepress_0-1       (naturally coded; _Idepress_0 omitted)
i.chronic         _Ichronic_0-2       (naturally coded; _Ichronic_0 omitted)
i.spouse          _Ispouse_0-2        (naturally coded; _Ispouse_0 omitted)

Multiple-imputation estimates                     Imputations     =         25
Competing-risks regression                        Number of obs   =       2450
                                                  Average RVI     =     0.0633
                                                  Largest FMI     =     0.2244
DF adjustment:   Large sample                     DF:     min     =     490.44
                                                          avg     =  456465.59
                                                          max     = 3376138.68
Model F test:       Equal FMI                     F(  14,92684.2) =       6.47
Within VCE type:       Robust                     Prob > F        =     0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ftow |   .0194868   .0165396     1.18   0.239    -.0130103     .051984
_Ixage_qgp_2 |  -.0205863   .0697261    -0.30   0.768    -.1572469    .1160744
_Ixage_qgp_3 |   .1384373   .0775296     1.79   0.074    -.0135181    .2903928
_Ixage_qgp_4 |   .2736007   .0804569     3.40   0.001     .1159079    .4312935
_Ixage_qgp_5 |   .5389833   .1224977     4.40   0.000     .2988917    .7790749
  _Igender_1 |          0  (omitted)
  _Itedlev_1 |    .005532   .0680682     0.08   0.935    -.1279276    .1389916
  _Itedlev_2 |   -.265273   .0717481    -3.70   0.000    -.4059386   -.1246075
_Ixrgrlump_1 |   .0404824   .0793603     0.51   0.610    -.1150627    .1960276
_Ixrgrlump_2 |  -.1665457   .0852699    -1.95   0.051     -.333677    .0005856
 _Idepress_1 |  -.0219574   .0583316    -0.38   0.707    -.1362962    .0923814
 _Ichronic_1 |    .052597   .0587296     0.90   0.371    -.0625291    .1677231
 _Ichronic_2 |   .2900125   .1099714     2.64   0.008     .0743182    .5057067
  _Ispouse_1 |  -.0720641   .0826383    -0.87   0.383    -.2340632     .089935
  _Ispouse_2 |   .0945365   .0524431     1.80   0.072    -.0083493    .1974222
------------------------------------------------------------------------------

. 
. 
. saveold newresult, replace
file newresult.dta saved

. log close
      name:  <unnamed>
       log:  /gpfs/home/fas/meghir/rg684/git/baowen/hpc4/log_hpc4.log
  log type:  text
 closed on:  20 Feb 2017, 09:06:21
-------------------------------------------------------------------------------
